var app = new Vue({
    el: '#app',
    data: {
        videoPop: false,
        sickChannel: 1,
        showPhoneMenu: false,
        isPhone: false,
        storeData: {
            swiperOption: {
                slidesPerView: 3,
                slidesPerColumn: 2,
                spaceBetween: 30,
                pagination: {
                    el: '.swiper-pagination',
                    clickable: true
                },
                breakpoints: {
                    640: {
                        slidesPerView: 1,
                        spaceBetween: 10
                    },
                    1024: {
                        slidesPerView: 2,
                        spaceBetween: 20
                    }
                },
                navigation: {
                    nextEl: '#pycialStores-wrap .swiper-button-next',
                    prevEl: '#pycialStores-wrap .swiper-button-prev'
                }
            },
            swiperOption2: {
                slidesPerView: 2,
                slidesPerColumn: 3,
                spaceBetween: 0,
                breakpoints: {
                    1024: {
                        slidesPerView: 1,
                        spaceBetween: 0
                    }
                },
                navigation: {
                    nextEl: '#pharmacyStores-wrap .swiper-button-next',
                    prevEl: '#pharmacyStores-wrap .swiper-button-prev'
                }
            },
            pycialStores: [{
                    name: 'Watson',
                    img: './images/m01.png',
                    url: 'https://www.watsons.com.tw/store-finder'
                },
                {
                    name: 'Costco',
                    img: './images/m15.png',
                    url: 'https://www.costco.com.tw/store-finder'
                },
                {
                    name: 'Cosmed',
                    img: './images/m02.png',
                    url: 'https://www.cosmed.com.tw/Contact/Shop.aspx'
                },
                {
                    name: 'Tomod’s',
                    img: './images/m03.png',
                    url: 'http://www.tomods.com.tw/stores'
                },
                {
                    name: '躍獅',
                    img: './images/m04.png',
                    url: 'http://dms.yeschain.com.tw/location.php?no=74&menu=6,74,74'
                },
                {
                    name: '大樹',
                    img: './images/m14.png',
                    url: 'http://www.greattree.com.tw/store.aspx'
                },
                {
                    name: '佑全/健康人生',
                    img: './images/m05.png',
                    url: 'http://www.yourchance.com.tw/index.php?temp=store&lang=cht'
                },
                {
                    name: '丁丁',
                    img: './images/m06.png',
                    url: 'https://www.norbelbaby.com.tw/TinTin/work.jsp'
                },
                {
                    name: '啄木鳥',
                    img: './images/m07.png',
                    url: 'https://www.woodpecker.com.tw/info/location'
                },
                {
                    name: '杏一',
                    img: './images/m08.png',
                    url: 'https://www.medfirst.com.tw/website_module_detail.php?website_module_classify_sn=100&website_module_sn=45'
                },
                {
                    name: '維康',
                    img: './images/m09.png',
                    url: 'http://www.wellcare.com.tw/wellindex/03map.htm'
                },
                {
                    name: '信東',
                    img: './images/m10.png',
                    url: 'http://www.sintong.com/tw_profile.php?Kid=103&Aid=103001&PHPSESSID=9609107199ff1341c00bb29c8560fc12'
                },
                {
                    name: '愛買',
                    img: './images/m11.png',
                    url: 'https://www.fe-amart.com.tw/index.php/store'
                },
                {
                    name: '日藥',
                    img: './images/m13.png',
                    url: 'http://www.jpmed.com.tw/shopinfo                       '
                },
                {
                    name: '美康',
                    img: './images/m12.png',
                    url: 'http://www.mecome.com.tw/front/bin/ptlist.phtml?Category=357323'
                }

            ],
            citi1Arr: ["台北市","宜蘭縣","花蓮縣","桃園市","基隆市","新北市","新竹市","新竹縣","台中市","台南市","南投縣","屏東縣","苗栗縣","高雄市","雲林縣","嘉義市","嘉義縣","彰化縣"],
            citiArr2: [["士林區","大同區","大安區","中山區","中正區","內湖區","文山區","北投區","松山區","信義區","南港區","萬華區"],["五結","宜蘭市","頭城","礁溪","羅東","蘇澳"],["玉里","吉安","花蓮市","新城","瑞穗"],["八德","大園","大溪","中壢","平鎮","桃園區","新屋","楊梅","龍潭","龜山","蘆竹","觀音(新坡)"],["中正","仁愛","安欒"],["八里","三重","三峽","土城","中和","五股","永和","汐止","板橋","泰山","淡水","新店","新莊","樹林","雙溪","蘆洲","鶯歌"],["新竹市"],["竹北","竹東","湖口","新埔","新豐"],["大甲","大肚","大里","大雅","太平","中區","北屯區","北區","西屯區","西區","東區","南屯區","南區","石岡","后里","沙鹿","東勢","烏日","梧棲","潭子","豐原","霧峰"],["下營","仁德","永康","玉井","白河","西港","佳里","中西區","北區","安南區","東區","南區","麻豆","善化","新化","新市","新營","學甲","歸仁","關廟","鹽水"],["名間","竹山","南投市","埔里","草屯","集集"],["九如","內埔","里港","東港","枋寮","林邊","長治","南州","屏東市","高樹","萬丹","萬巒","潮州","麟洛","鹽埔"],["竹南","後龍","苑裡","苗栗市","通霄","銅鑼","頭份"],["三民","大社","大寮","小港","仁武","左營","岡山","林園","阿蓮","前鎮","美濃","苓雅","梓官","湖內","新興","楠梓","路竹","鼓山","旗山","鳳山","橋頭","鹽埕"],["二崙","土庫","大埤","斗六","斗南","水林","北港","西螺","東勢厝","林內","虎尾","崙背","麥寮","莿桐","褒忠"],["嘉義市"],["大林","民雄","朴子","竹崎","新港","溪口"],["二水","二林","北斗","永靖","伸港","秀水","和美","社頭","芬園","花壇","員林","埔心","埤頭","鹿港","溪湖","彰化市","福興"]],
            p_storeName: ["博惠藥局", "千福大業高島屋", "春天－德行店", "杏城藥局", "田倉藥局", "盛康天母店", "博信藥房", "南風藥局", "春天藥品－１６大南店", "春天藥品－８８總公司", "日康藥局", "佳赫藥局", "美麗田藥局", "春天藥品－０３華齡店", "貝爾健康美容企業有限公司", "達揚藥局", "盛康-士林店", "加赫藥局", "石川藥師藥局", "盛康-前港店", "慈航藥局", "家赫藥局", "安泰藥局", "三銘大藥局", "保慶藥局　Ｂ", "快安藥局", "宏陽健康事業股份有限公司", "富康藥局", "宏泰藥妝行", "正中藥局", "春天藥品－０２酒泉店", "盛康藥局", "建利西藥房", "建祥藥局　Ｂ", "新聖安西藥房", "益新生技股份有限公司", "建如藥局", "龍護大藥局", "正昌藥局", "博興藥局", "新廣生西藥房", "康祥藥局", "千福藥品有限公司", "元氣生活健保藥局（ＡＧ１）", "博昱大藥局", "祥瑞中西大藥局", "師大藥局", "燕福藥局", "一心藥局", "聖英藥品有限公司", "永誠藥局", "吳順安藥局", "展佑藥局", "美日藥局", "樂活苑藥局", "榮昌藥局", "仁一藥局", "王中興藥局", "長安藥局", "盛康-農安店", "大直藥局", "春天－錦州店", "中山藥局", "盛康醫藥股份有限公司", "盛康-吉林店", "富宥康生活事業有限公司", "古亭西藥房", "東霖醫療儀器行", "合泰藥品有限公司", "國杏藥局", "正康藥房有限公司", "中華西藥行", "中英大藥房", "中心藥局", "濟仁藥局", "大盛藥品有限公司", "吉星藥局", "信康藥局", "進達藥局", "佳和藥局", "上海聯合藥房股份有限公司", "祥全藥局", "活力健康藥妝藥局", "建祥城中藥房", "杏佳藥局", "樂康藥妝藥局", "清白藥局", "盛康藥局-內湖店", "安安藥局", "幼信有限公司", "江南大藥局", "三宜藥房", "西湖藥局", "綠杏事業股份有限公司", "康宜庭-景文店", "萬隆大藥局", "康宜庭-總店", "華君藥局", "康宜庭-興隆店", "逸仙藥師藥局", "博揚商行", "康宜庭-萬隆店", "益元中西藥房", "春天藥品－０１吉利店", "盛康-北投店", "康揚藥局", "丸三大藥局", "春天藥品－１０北投店", "春天藥品－０５致遠店", "建民藥局", "川秀藥局", "合生藥局", "德恩藥師藥局", "立康大藥局", "又又藥局", "榮星藥局", "唯康藥局", "傑安藥局　ＩＣ", "予志藥局", "盛康-延壽店", "芝欣藥局", "安佑藥局", "榮泰藥局", "麗中藥局", "綠杏大藥局", "正和藥局", "盛康-信義店", "立信藥局", "九州藥局", "三立藥局", "德康大藥局（ＡＧ２２）", "洪暘藥局－博登連鎖店", "盛康-松德店", "富康活力藥局", "加欣藥局", "小藥師健保藥局", "祥安藥局", "佳龍藥局", "新東發藥局", "亞博藥師藥局", "老永茂西藥房", "大順藥品有限公司", "康之友藥局", "中韓西藥行", "日昇西藥房", "健華西藥有限公司", "宏越藥局", "三源藥局", "專品藥局", "信義藥局", "日昇藥局", "大榮藥師藥局", "微風藥師藥局", "中興藥局", "宜生藥局", "振芳藥局", "南興西藥房　Ｗ", "文化藥師藥局", "頭城藥局", "三華藥局", "建芳藥局", "長生藥局", "天一藥局　Ｂ", "健康家藥局", "信隆藥局", "南陽藥局", "新豐藥房", "仁德藥房", "德興藥局", "一生西藥房", "永和藥局", "慈慧健保藥局", "大德藥局", "新惠誠藥妝", "益康大藥局", "富一藥局", "張藥局", "健安西藥房", "祥康網路藥局", "千登健保藥局", "吉康藥局", "德生藥局", "黃藥局", "立健藥局", "鴻安藥房", "環球生活事業股份有限公司", "全球-健民大藥局", "全球-環球店", "育康-八德大湳店", "全球-佳美大藥局", "保和大藥局", "安欣大藥局", "資生大藥局", "新資生大藥局", "資生大藥局中壢店", "資生內壢大藥局", "聯合藥局", "億源藥局", "全球-中壢宜美店", "育康生技有限公司", "育康-中壢中正店", "全球-中壢永美店", "領耀大藥局", "真善美內壢店", "千福藥品有限公司(中壢)", "福德藥局", "中壢聯合藥局", "榮善堂中西藥行", "得康藥局３０１２１１３５", "賀生西藥房", "全球-中壢同慶店", "真善美連鎖藥妝-內壢店", "現代藥局", "閤家康聯合藥局", "育康-平鎮壢新店", "唯康藥局", "全球-和平店", "聖昌藥局", "莘莘藥局", "育康-桃園中正店", "均康藥局", "真善美大業店", "全球-桃園奇美店", "真善美連鎖藥妝-大業店", "國民企業股份有限公司（Ｈ２９", "壽安藥局", "大一葯局", "天勝西藥房", "品一藥局", "全球-維格店", "五代全民藥局", "全球-龍安店", "新華興清溪藥局", "真善美連鎖藥妝-桃園新屋店", "真善美桃園新屋店", "資生楊梅大藥局", "聖鑫藥局", "弘安藥局", "真善美連鎖藥妝-楊梅店", "真善美楊梅店", "全球-埔心大藥局", "全球藥局", "龍大藥師藥局", "中興藥師藥局", "全球-龍正藥局", "真善美連鎖藥妝-龍潭百年店", "繕葆藥局", "101藥師聯合藥局", "龍潭西藥房", "康熙藥局", "弘安育藥局", "真善美龍潭百年店", "長青藥局", "育康-龜山中興店", "凱悅藥局", "德美藥局", "九德藥局", "竹康藥師藥局", "恆安藥局", "誼康藥妝", "真善美連鎖藥妝-桃園觀音店", "廣福藥局", "真善美桃園觀音店", "杏光西藥房", "喬寶藥局", "婕登連鎖藥局", "何房藥局", "永隆藥局", "大田大藥局", "宏仁藥局", "長春藥局", "瑞平藥局", "春天藥品－０８五華店", "美滿藥局", "玉美藥局", "鴻泰藥局", "德榮藥局", "臻曜藥局", "禮隆藥局", "青松藥局", "天賜藥局", "小林健保藥局", "吳廣隆藥局", "家福藥局　Ｂ", "穗元大藥局", "萊康健保藥局", "天佑藥局　Ｂ", "臻燿藥局", "中華健保藥局", "厚德藥局", "陽光藥師藥局", "北大藥局", "全球-欣美大藥局", "進安大藥局", "盛加藥局", "三峽大昌藥局", "惠蒼西藥房", "盛安大藥局", "陽光活力藥局", "埔銓藥局(分店)", "仁泰有限公司", "德隆藥局", "吉城大藥局", "宏奇藥局", "祥發藥局", "璨鴻藥局", "立新醫療器材有限公司", "元蒼藥局", "欣安藥局", "皇安生技股份有限公司", "威安生活事業股份有限公司", "瑞發藥局", "信隆大藥局", "大竹藥局", "家家藥粧有限公司", "九崧藥局", "欣安藥局", "銓家藥局", "貞心藥局", "闔安藥局", "宏安藥局", "虹元藥局", "易安堂健康有限公司", "台化藥局", "威安藥局中和店", "弘光藥局", "原大藥局", "康宏安藥局", "緣來藥師藥局", "永利藥局", "德和便利藥局", "威康藥局", "台大藥局", "華特健康藥局", "永康慈航藥局-汐止", "富康活力藥局總倉", "春德堂藥局", "汐芷藥局", "廣誠藥師藥局", "慈航藥局-南港", "進發大藥局", "健業藥局", "埔墘藥局", "新進發藥店", "廣欣藥局", "戴安藥局", "埔全藥局", "賜安藥局", "友祥藥局", "聯康藥局", "廣欣藥局-廣安店", "大楓藥師藥局", "大福藥局", "大豊開發股份有限公司", "大峰藥局", "翰林藥局　Ｂ　ＩＣ", "南雅藥局", "廣益藥局", "安佑藥局", "詠濟藥品有限公司", "向康藥局", "廣欣藥局-廣信店", "幸福藥局", "健康藥師藥局", "華特藥局", "吉利安健保藥師藥局", "惠元藥局", "上全藥局", "天康連鎖－淡水店", "春天藥品－１５淡水店", "春天－１７竹圍", "天文大藥局ＴＨ０００４", "伯聯藥局", "康宜庭-大坪林店", "康宜庭-市公所店", "康宜庭-北新店", "德莘藥局", "均安藥局", "杏運草藥局", "威安藥局-新店中正店", "康宜庭北新藥局", "三民藥局", "活元藥局", "巧新婦嬰生活藥妝有限公司", "康宜庭-民權店", "康宜庭-碧潭店", "德翰藥局", "招安藥局", "合康藥師藥局", "春天一心店", "吉田藥局", "陽光藥局", "微笑埔銓藥局", "天利藥局　Ｗ", "東京大藥局", "庭安藥局", "微笑埔銓藥局", "協安大藥局", "保康藥局", "弘昌藥局", "松南藥局", "天士藥局", "博登長安店(慧安藥局)", "永結西藥房", "芯聯藥局", "中美永結藥局", "華興藥師藥局", "理方藥局", "春天藥品－１２中原店", "蓁美健康藥局", "萊康連鎖藥局", "博登藥局-蘆洲長榮店", "唯新藥局", "鶯歌宏達藥局", "唯新婦嬰生活藥妝有限公司", "快安藥師藥局（Ａ１１）Ｏ", "三立藥局", "中正藥妝生活館", "真善美新竹經國店", "合康連鎖藥局(西大店)", "合康連鎖藥局(食品店)", "芳鄰藥局", "新芳鄰藥局", "真善美新竹建中店", "康博中西藥局", "新康藥局", "新芳鄰藥局", "合康生活－中華店", "快樂連鎖藥局(立新店)", "聖心藥局", "仁美藥局", "祥盛生技有限公司(台安西大)", "婷婷藥局", "信芳藥局", "真善美新竹中央店", "真善美新竹食品店", "合康連鎖藥局(湳雅店)", "新祥發西藥房", "金松大藥局", "法瑪士藥局", "高晟健康事業有限公司(快樂大庄店)", "合康藥局中華店(合康國際藥品公司)", "友一藥局", "合康連鎖藥局(竹北店)", "真善美竹北勝利店", "合康連鎖藥局(竹北二店)", "康立藥局", "快樂連鎖藥局(鴻達店)", "華德藥局", "榮信藥局", "國豐大藥局Ｂ", "快樂連鎖藥局總倉", "合康連鎖藥局(竹東店)", "日榮堂藥房", "如家藥師藥局", "真善美湖口達生店", "合康連鎖藥局(湖口店)", "真善美湖口民族店", "真善美新竹竹中店", "真善美湖口成功店", "真善美新埔店", "真善美新豐店", "盈盈藥局", "大甲福倫藥局", "必安藥局", "新庄藥局", "慈輝藥師藥局", "大明永欣藥局３０１０６６７０", "仁康藥局", "德豐藥品股份有限公司（ＡＧ１４）", "三商藥局", "福德健保處方藥局", "學府藥局", "大雅藥局", "樹德大藥局", "八醫健保藥局", "雪仁藥局", "信賢藥局有限公司", "東亞藥師大藥局Ｂ", "佑昇藥局", "一安堂藥局　Ｗ", "老順安大藥局", "正三吉藥房", "宏信藥品股份有限公司", "北屯德康藥局", "美得康藥局", "佳美藥局", "安順藥局", "松竹大藥局", "兩隻老虎藥局", "中央藥局", "弘映藥局", "豐禾藥局", "英全藥局", "中心旗艦藥局", "倫彰西藥房", "瑞昌藥局", "東生藥局", "祥和藥局", "宜泰藥師藥局", "德康藥局", "青育藥局", "逢甲藥局", "新利賀專業藥局", "東亞藥師藥局", "達康藥局", "永旭大藥局", "安德生物科技股份有限公司", "廣安大藥局", "新永富藥局", "忠信藥局", "向上中西藥局", "麗新健保大藥局", "裕源藥局", "向日睽藥局", "拓撲藥品股份有限公司", "信和藥局", "中大藥局", "群益藥局", "大愛藥品公司", "大墩何藥局", "濟安堂藥局", "大業藥局", "承諭藥局", "長映藥局", "睦林藥局", "義興配藥局", "台大藥局", "學府藥局", "和生藥局", "宏信大藥局", "鴻儀大藥局", "原隆安藥局", "泉興大藥局", "日美藥粧-台中麗寶", "東亞藥局", "永富藥局", "翔泰藥品有限公司", "濟生一藥局", "國良豐藥局", "仁生藥局", "千百岳大藥局", "新明通藥局", "全成國際藥品有限公司(總倉)", "萬信藥局", "真安大藥局", "大芳藥局", "立達大藥局", "康吉藥局", "皇杰藥局", "成記藥局", "潭子福倫藥局", "美日藥局", "恆安大藥局", "維立藥局", "進安藥局", "豐嶸大藥局", "祥暘藥局", "瑞瑛藥局", "浤泰大藥局", "楊生藥局", "桂林堂藥房", "振裕藥局", "山川中西藥局", "嘉鶴藥局", "成吉藥局", "良方藥局", "慈惠藥局", "大力藥局", "大灣藥局", "志華西藥房", "美德生醫藥局", "家嘉藥局", "愛兒屋藥品有限公司", "家嘉藥局", "玉井藥局", "博愛中西藥局　Ｂ", "源大醫藥局", "芳瑜藥局", "安泰藥局", "長榮藥局", "佳里藥局　Ｂ", "建昌藥局佳里店", "萊安藥局", "長興成藥品有限公司", "安興藥局", "南安藥房有限公司　Ｗ", "炎光藥行股份有限公司", "田邊藥局", "新生西藥房　Ｗ", "平安藥局", "雅里藥局", "千多藥局", "大正藥局", "早安北園藥師藥局", "嘉洲藥局", "泰赫中西藥局", "龍金藥品有限公司", "仲宏藥局", "建壽藥局", "大家藥局", "菁安藥局　Ｂ", "光明宜康藥局", "榮記藥行有限公司", "王藥局", "周藥師藥局", "良泰藥局", "詩柏爾藥妝生活館", "豐陽藥局", "大吉藥局", "安安藥局", "平安藥局", "仁愛藥局", "富傑藥局", "新和德健保藥局", "重仁藥局　Ｂ", "慶豐綜合藥局", "麗暉藥師藥局（ＡＧ１６）", "新日康藥局", "佑康藥局", "人生藥局", "佑康人生有限公司", "大安藥局", "美兆藥業有限公司", "人安藥局", "心得藥局", "躍達藥局", "安麗兒藥局", "健新藥局", "民生藥局", "獻奇藥局", "慈仁藥局", "早安藥局", "優適藥局", "和康藥局", "廣元藥局", "祝安堂藥房", "資生藥局Ｗ", "集成藥局", "埔里福倫藥局", "順安藥局", "建和藥局", "萬壽堂藥局", "國聖藥局", "家禾藥局", "穎昇藥局", "內埔藥師藥局", "內埔藥師藥局文化店", "長生藥局", "里港藥局", "富安(黑豬)藥局", "東華藥局", "保生藥局", "大眾藥局", "欣大眾藥局", "吉村藥局", "隆山藥局", "和成健康藥局", "忠安中西藥局", "南州健人藥師藥局", "三鐵藥妝有限公司", "三和藥局", "美加康藥局", "陽生藥局", "大茂藥局", "樹生藥局", "大何有限公司", "新東海藥局", "大林藥局", "信安藥局", "信康藥粧藥局-復興店(乖寶寶)", "新東京藥局", "寶慷藥局", "葉藥局", "進德藥局", "萬丹藥局", "博林藥局", "黃藥師藥局", "昕妙春藥局", "正宗西藥房", "安欣藥局", "立登藥局", "宏大藥局", "德安西藥房", "鴻輝藥局", "信和西藥房", "盛安藥房", "發元西藥房", "上林藥局", "維康藥局", "家嘉藥局", "辰安藥局", "樂田藥妝藥局", "信源西藥房", "康利藥局", "泉興藥局", "佳慶股份公司", "澄和藥局　Ｂ", "欣仁惠藥局", "安信藥局", "金鼎藥局", "仕康生活藥品有限公司", "人禾藥局", "冠華藥局", "明誠店", "天祥店", "澄清店", "陽明店", "上鼎藥師健保藥局", "立米藥品有限公司", "大社店", "福民藥房", "安泰藥局", "洋洋藥局（ＴＯ４）", "中美藥師藥局", "金發藥局", "禾田生技醫藥股份有限公司", "鳳明藥局", "奇美藥局", "四季藥局", "星億藥局", "東京公司", "八德中店", "仁雄店", "宏仁藥局", "翔生藥局（Ｏ８）", "金元藥局", "吉辰藥局", "必健藥局", "安闔藥局", "育安健保藥局", "有機藥局", "麥田藥局", "和信藥師健保藥局", "勁好健保藥局", "河堤店", "裕明店", "榮總店", "裕誠店", "重愛店", "崇德店", "華夏店", "金德藥房", "愷頓藥品股份有限公司", "隆全藥局", "惠光西藥局", "金德昌藥局", "敏安藥局", "福安藥妝有限公司", "金高泰藥局", "和德藥局", "久億藥局　Ｏ", "八仙藥局", "隆德藥局", "青年生技公司", "仙光藥局", "夢時代店 ", "健民藥局－博登連鎖店", "合豐藥局", "人和藥局", "英祥藥局", "柏松藥局", "健配藥品股份有限公司", "加和藥局", "御康養生有限公司", "景福藥局　Ｂ", "好郝藥局", "中美藥局", "幸福藥師藥局", "三和藥局", "順成藥局", "大明成西藥房", "伊生藥局", "華安藥局", "銘生藥局", "南星藥局　Ｗ", "信成大藥局", "成吉藥局", "新友藥局", "世詠藥局Ｐ", "建佑藥局", "成安藥局", "正人藥師藥局", "連仲藥局", "皇慶藥局", "德民藥局", "土庫店", "德賢店", "軍校店", "宗明藥局", "新永安藥局　Ｂ", "弘興藥局", "惠民藥局", "華榮店", "明倫店", "美東二店", "天天美藥局", "賜安藥局　Ｗ", "辰安實業社", "誠大藥局", "伊甸藥師藥局", "福德中西藥局　Ｂ", "一泰大藥局", "北京藥局", "鳳林藥局", "護民藥房", "大中華藥局", "青年店", "新富店", "民權藥局", "健爾康生活事業股份有限公司", "南京藥局", "成恩藥局", "義泰藥局", "健康藥局（ＡＧ１５）", "友杏健康健保藥局", "茂恩藥局", "上好藥局", "永光藥局", "武田藥局", "南星大藥局", "井上西藥房", "仁安堂藥局", "惠生大藥局", "全仁藥局", "樂芯藥局", "一生藥局", "瑞大藥局", "萬安西藥房", "昇陽大藥局", "端發藥局", "張維修藥局", "崇愛藥局", "和勇藥局", "明泰藥局－博登連鎖店", "召安大藥局（Ｖ９）", "新宏祥西藥房", "徠的安藥師藥局", "齊悅藥局", "照安藥局", "大安西藥房", "松柏藥局", "興業藥局", "中興中西藥局　Ｂ", "保健藥局", "廣元藥局", "誠泰藥師藥局", "振安藥局", "弘安藥粧生活館", "安泰藥局", "大向藥局", "大東藥局", "萬有藥局", "大順藥局", "朝榮西藥房", "榮美藥品有限公司", "久久藥局", "德信藥局", "佑康藥局", "嘉新藥局", "育生西藥房", "安濟藥局", "二林福倫藥局", "嘉信藥局", "合康藥局", "天喜生大藥局", "伸港藥局", "欣冠藥局", "健全藥局", "正光藥局中正店", "和美福倫藥局", "春生藥局愛民店", "春生藥局新庄店", "萬春西藥房", "和平藥局", "張藥局", "啟安大藥局", "泰安西藥房", "花壇福倫藥局", "善生藥局", "恆安藥局", "大福藥局", "家家藥局", "日信藥品有限公司", "日信西藥房", "光成藥房", "醫聯藥師藥局", "必安藥局", "廣生堂藥局", "員林鼎澄藥局", "信昇藥局", "永康藥局", "埤頭藥局", "勝華西藥房", "永吉藥局", "良安藥局", "真豐藥局-鹿港店", "成安藥局", "樺霖藥業", "三立大藥局　Ｂ", "信生西藥房", "尚豪藥局", "康好健保藥局", "長聖樹藥局", "彰化福倫藥局", "鼎澄秀傳一店", "瑞成藥房"],
            p_storeArr: ["台北市士林區華榮街16號", "台北市士林區忠誠路二段55號B1", "台北市士林區德行東路76號", "台北市士林區天母東路24號1樓", "台北市士林區士東路124號", "台北市士林區天母東路8巷84號", "台北市士林區延平北路6段61號", "台北市士林區美崙街19號", "台北市士林區大南路317、319號1樓", "台北市士林區通河東街一段167巷35號5樓(周二.五13:00~17:00)", "台北市士林區士東路12號1樓", "台北市士林區文昌路44號", "台北市士林區通河街78號", "台北市士林區華齡街38號", "台北市士林區中山北路七段82巷9號", "台北市士林區社正路36號", "台北市士林區德行東路206-1號", "台北市士林區文昌路76號", "台北市士林區忠義街７０號", "台北市士林區前港街28號", "台北市士林區文林路441號", "台北市士林區忠義街80號", "台北市士林區延平北路6段83號（實際使用1、2樓）", "台北市大同區迪化街１段８０號", "台北市大同區保安街２１號", "台北市大同區南京西路282-284號", "台北市大同區承德路一段１７號７樓", "台北市大同區延平北路二段126號", "台北市大同區酒泉街131號", "台北市大同區民族西路213號", "台北市大同區酒泉街９４號", "台北市大同區延平北路2段164號", "台北市大同區重慶北路一段85-3號", "台北市大同區寧夏路17號", "台北市大同區昌吉街１３０號", "台北市大安區復興南路一段368-1號3樓", "台北市大安區和平東路三段228巷11號", "台北市大安區大安路一段224巷7號", "台北市大安區通化街38巷9號1樓", "台北市大安區四維路198巷28號", "台北市大安區仁愛路四段32號", "台北市大安區忠孝東路四段216巷15號", "台北市大安區羅斯福路3段245號10樓之1", "台北市大安區新生南路1段161巷10號1樓", "台北市大安區樂業街150號", "台北市大安區復興南路一段107巷49號", "台北市大安區師大路99號", "台北市大安區羅斯福路三段283巷14弄14號之3", "台北市大安區和平東路3段238號", "台北市大安區信義路四段265巷26號", "台北市大安區忠孝東路四段216巷25之1號", "台北市大安區濟南路3段22－1號", "台北市中正區長春路１４６之１號１樓", "台北市中正區天津街66號1樓", "台北市中山區北安路５４６號", "台北市中正區雙城街１７之３號", "台北市中正區林森北路５２０號", "台北市中正區龍江路２７３號", "台北市中正區長安東路２段１７１之３號", "台北市中山區農安街267號", "台北市中山區北安路６１７號１樓", "台北市中山區錦州街２１３號", "台北市中山區林森北路１２８號", "台北市中山區建國北路２段１２９號７樓", "台北市中山區吉林路397號", "台北市中山區北安路６０８巷５弄２２號", "台北市中正區汀州路三段117號", "台北市中正區汀州路三段１１３號", "台北市中正區衡陽路２０號１樓", "台北市中正區延平南路１７１巷３號 ", "台北市中正區漢口街１段２２號", "台北市中正區衡陽路4號", "台北市中正區永綏街６號", "台北市中正區汀州路三段１２１號", "台北市中正區濟南路二段２２號", "台北市中正區中華路一段21巷10號", "台北市中正區襄陽路１９號  ", "台北市中正區南昌路１段１４３號", "台北市中正區中華路二段４５３號", "台北市中正區公園路３０號", "台北市中正區衡陽路３２號", "台北市中正區信義路二段７９巷１５之８號", "台北市中正區中華路二段315巷1號", "台北市中正區武昌街ㄧ段２９號２樓  ", "台北市內湖區康寧路一段５１號１樓", "台北市內湖區文德路１１７號", "台北市內湖區東湖路１０８號", "台北市內湖區康寧路3段99巷10弄1號", "台北市內湖區康寧路１段４２號", "台北市內湖區麗山街３６４巷２號", "台北市內湖區文德路２２巷９弄５６號", "台北市內湖區內湖路一段737巷31號", "台北市內湖區內湖路１段３５５號", "台北市文山區興隆路三段１１１號１樓　", "台北市文山區景文街97號", "台北市文山區羅斯福路５段２１８巷１５號", "台北市文山區興隆路四段64之1號", "台北市文山區興隆路二段６０號", "台北市文山區興隆路三段200號", "台北市文山區興隆路二段２１８之１號１樓", "台北市文山區景興路１８１號", "台北市文山區羅斯福路五段202號", "台北市北投區光明路106號", "台北市北投區吉利街120號", "台北市北投區致遠2路141號", "台北市北投區中和街322號", "台北市北投區自強街105號", "台北市北投區中央南路一段76號", "台北市北投區致遠一路一段132號1－2樓", "台北市北投區光明路161號", "台北市北投區石牌路2段99巷9號1樓", "台北市松山區南京東路五段１２３巷４５號", "台北市松山區八德路二段378號1樓", "台北市松山區八德路四段２－１號", "台北市松山區民生東路五段238號", "台北市松山區南京東路四段133巷5弄1號", "台北市松山區八德路三段211號", "台北市松山區八德路二段437巷7弄8號", "台北市松山區富錦街521號", "台北市松山區延壽街111號", "台北市松山區八德路三段148號", "台北市信義區吳興街２４７號１樓", "台北市信義區光復南路419巷19號", "台北市信義區福德街217號", "台北市信義區吳興街241號", "台北市信義區吳興街225巷6號", "台北市信義區信義路六段69號", "台北市信義區松山路403號", "台北市信義區和平東路三段２３９號１樓", "台北市信義區忠孝東路五段492巷34號", "台北市信義區松山路541巷21號", "台北市信義區富陽街86號", "台北市信義區松德街40號", "台北市南港區研究院路一段101巷8號", "台北市南港區南港路２段２６號", "台北市南港區福德街３２０之１號", "台北市南港區中坡南路２５號", "台北市南港區研究院路２段８０號", "台北市南港區成福路１９８號", "台北市南港區興華路８１號", "台北市萬華區廣州街６４號  ", "台北市萬華區萬大路４８６巷２６號", "台北市萬華區青年路20號", "台北市萬華區西寧南路２０５號", "台北市萬華區廣州街１２４號", "台北市萬華區康定路３２８號", "台北市萬華區中華路二段３９２號", "台北市萬華區康定路１９７號", "台北市萬華區長沙街２段７１之１號", "台北市萬華區青年路２８號", "宜蘭縣五結鄉中正路二段59號", "宜蘭縣宜蘭市校舍路23號", "宜蘭縣宜蘭市神農路二段46號", "宜蘭縣宜蘭市中山路三段209號", "宜蘭縣宜蘭市新民路111號", "宜蘭縣宜蘭市中山路三段179號", "宜蘭縣宜蘭市光復路130號", "宜蘭縣宜蘭市復興路一段131號", "宜蘭縣頭城鎮開蘭路134號", "宜蘭縣礁溪鄉中山路2段202號", "宜蘭縣羅東鎮民權路31號", "宜蘭縣羅東鎮復興路1段1號", "宜蘭縣羅東鎮南昌街99號", "宜蘭縣宜蘭市東港路48之2號", "宜蘭縣羅東鎮南門路5號", "宜蘭縣蘇澳鎮中山路120號", "宜蘭縣蘇澳鎮江夏路26號", "花蓮縣玉里鎮中華路１４０號  ", "花蓮縣玉里鎮中山路二段５８號", "花蓮縣玉里鎮光復路１５８號", "花蓮縣吉安鄉北昌村建國１段１４３號之１", "花蓮縣吉安鄉建國路二段１６５號", "花蓮縣花蓮市中山路１５２號", "花蓮縣花蓮市中華路３４號１樓", "花蓮縣花蓮市國富里富國路１４６號１樓", "花蓮縣吉安鄉宜昌村中華路二段２０１號", "花蓮縣花蓮市中山路１０６號", "花蓮縣花蓮市中山路５３７號", "花蓮縣花蓮市中美路８７－２號１樓", "花蓮縣花蓮市中央路三段６５３號", "花蓮縣花蓮市中正路３６０號", "花蓮縣花蓮市中山路３２９號", "花蓮縣新城鄉北埔路２０３號", "花蓮縣瑞穗鄉中華路１２號", "桃園市八德區介壽路二段368號", "桃園市八德區建國路866號", "桃園市八德區介壽路二段282號", "桃園市八德區介壽路一段831號", "桃園市八德區廣福路24號", "桃園市八德區介壽路一段688號", "桃園市大園區中山北路36號", "桃園市大溪介壽路758號", "桃園市大溪區康莊路130號", "桃園市大溪區復興路92之1、96號1樓", "桃園市中壢區福州二街409號", "桃園市中壢區成章一街162號 ", "桃園市中壢區中山路229號", "桃園市中壢區林森路176號", "桃園市中壢區永福路1080號", "桃園市中壢區健行路216號2樓", "桃園市中壢區中正路213號", "桃園市中壢區中山東路二段530號", "桃園市中壢區中央里元化路97號1樓", "桃園市中壢區成章二街530號", "桃園市中壢區元化路357號B1(中壢SOGO B1)", "桃園市中壢區福德路30號", "桃園市中壢區大同路131號", "桃園市中壢區前龍街9號", "桃園市中壢區龍岡路二段89、91號", "桃園市中壢區華勛街165號", "桃園市中壢區健行路52號", "桃園市中壢區成章二街530號", "桃園市平鎮區育達路96號", "桃園市平鎮區中豐街山頂段256號", "桃園市平鎮區廣泰路126號", "桃園市平鎮區中豐路南勢二段144號", "桃園市平鎮區和平路160號", "桃園市桃園區中正路1238號", "桃園市桃園區莊敬路一段368號", "桃園市中正路576號", "桃園市桃園區中聖里國鼎一街27號1樓之4", "桃園市桃園區大業路一段128號", "桃園市中正五街185號", "桃園市大業路1段128號", "桃園市桃園區中正路578號2樓", "桃園市桃園區介壽路402號", "桃園市桃園區中山路684之1號1樓", "桃園市桃園區安樂街53號", "桃園市桃園區建新街76號", "桃園市桃園區大興西路二段129號", "桃園市桃園區中山路九十七號", "桃園市桃園區龍安街111號", "桃園市桃園區中山東路10號1樓", "桃園市新屋區中華路251號", "桃園市新屋區中華路251號", "桃園市楊梅區楊新路100號", "桃園市楊梅區永美路389號", "桃園市楊梅區新農街一五號", "桃園市楊梅區光華街14號", "桃園市楊梅區光華街14號", "桃園市楊梅區永美路395號", "桃園市龍潭區北龍路185號", "桃園市龍潭區中正路169號", "桃園市龍潭區中興路399號", "桃園市龍潭區中正路231號", "桃園市龍潭區中豐路309號", "桃園市龍潭區中興路309號", "桃園市龍潭區中正路44號", "桃園市龍潭區龍華路27號", "桃園市龍潭區中正路128號", "桃園市龍潭區北龍路144號", "桃園縣龍潭鄉中豐路309號", "桃園市龜山區公西村復興一路82號", "桃園市龜山區中興路一段22號", "桃園市龜山區復興一路126號", "桃園市蘆竹區中山路159號1樓", "桃園市蘆竹區中山路69號", "桃園市蘆竹區大竹路525號", "桃園市蘆竹區忠孝西路36號", "桃園市蘆竹區奉化路126號", "桃園市觀音區草傫村四維路2號", "桃園市觀音區新坡里新生路４１號", "桃園市觀音區草漯村四維路2號", "基隆市中正區和一路１１８號", "基隆市中正區義二路６６號１樓", "基隆市仁愛區愛三路53號", "基隆市仁愛區忠三路８１號  ", "基隆市仁愛區仁三路２５之１號", "基隆市仁愛區仁二路５號", "基隆市安欒區安樂路二段１３０號", "基隆市安欒區基金一路１７４－１６號", "新北市八里區鄉中山路二段３９１號１樓", "新北市三重區五華街７３號＊另打ＤＮ，發票另寄台北市士林區大南", "新北市三重區中華路16號", "新北市三重區力行路二段136巷49弄2號", "新北市三重區新北市三重區重新路一段95號", "新北市三重區中華路91號", "新北市三重區重新路一段129號", "新北市三重區自強路四段64號", "新北市三重區中正北路336號", "新北市三重區正義北路１４１號１樓", "新北市三重區文化北路６１－１號１樓", "新北市三重區長壽西街5之1號", "新北市三重區仁愛街682號", "新北市三重區力行路一段１５１號", "新北市三重區溪尾街176號", "新北市三重區大同北路８號  ", "新北市三重區集美街150號", "新北市三重區中華路９５號", "新北市三重區大智街175號", "新北市三重區三和路二段１８２號１樓", "新北市三峽區大義路9號1、2樓", "新北市三峽區大同路52號", "新北市三峽區民生街174號", "新北市三峽區民生街49號", "新北市三峽區民生街56號", "新北市土城區中央路2段216號", "新北市土城區中央路一段258號", "新北市土城區延和路103號", "新北市土城區裕民路164號1樓", "新北市土城區延和路16之3號1樓", "新北市土城區裕民路１５３號", "新北市土城區學府路一段205號", "新北市土城區延吉街126號1樓", "新北市土城區青雲路255號", "新北市土城區延和路１９１號", "新北市土城區光明街５號", "新北市土城區學府路一段69號", "新北市中和區立德街72巷20號", "新北市中和區中山路３段１３６巷１０弄８號", "新北市中和區景新街３３８號地下一樓", "新北市中和區民享街５６之１號", "新北市中和區安樂路6號", "新北市中和區和平路２４４號", "新北市中和區民德路４３號", "新北市中和區南華路２０號", "新北市中和區立德街72巷20號", "新北市中和區員山路３１９號１－２樓", "新北市中和區永貞路2801號", "新北市五股區成泰路3段579號  ", "新北市五股區成泰路二段１３６號  ", "新北市五股區自強路56號", "新北市永和區智光街１２１號４樓", "新北市永和區勵行街１１９號", "新北市永和區中和路429號", "新北市永和區竹林路６６巷１９號", "新北市永和區永和路１段２０號", "新北市永和區保福路二段78號", "新北市永和區福和路２５０、２５２號１樓", "新北市永和區永利路９、１１號１樓", "新北市永和區得和路１９２號", "新北市永和區中正路１５３號", "新北市永和區保平路２４０號", "新北市永和區永貞路３６２號１樓", "新北市汐止區中興路169號", "新北市汐止區新台五路一段102號19樓", "新北市汐止區新台五路一段２２０號", "新北市汐止區福德一路２５５號", "新北市汐止區台北縣汐止市建成路２２號", "新北市汐止區研究院路一段101巷8號", "新北市板橋區民治街101號", "新北市板橋區文化路二段47號", "新北市板橋區永豐街36-38號", "新北市板橋區大同街24號", "新北市板橋區雙十路三段52號", "新北市板橋區溪北路54號", "新北市板橋區忠孝路33號", "新北市板橋區信義路60號", "新北市板橋區裕民街107號", "新北市板橋區南雅南路２段１４４巷４號１樓", "新北市板橋區四維路355號", "新北市板橋區懷仁街８４號（１樓）", "新北市板橋區三民路一段31巷15號之1", "新北市板橋區南門街81號", "新北市板橋區莒光路168號", "新北市板橋區中正路266號", "新北市板橋區南雅南路一段5巷22號", "新北市板橋區自由路21號", "新北市板橋區館前西路152-2號", "新北市板橋區幸福路２３號", "新北市板橋區實踐路147號", "新北市板橋區四維路304號", "新北市板橋區四維路106號", "新北市泰山區明志路二段３２３號", "新北市泰山區明志路一段260號", "新北市淡水區中山北路一段100號", "新北市淡水區草東里中正路96號", "新北市淡水區民族路36號", "新北市淡水區學府路4９號1樓", "新北市淡水區中山北路一段４９號＊另打ＤＮ，發票另寄台北市士林", "新北市淡水區民權路８９號＊另打ＤＮ，發票另寄台北市士林區大南", "新北市淡水區新春街136號", "新北市淡水區清水街9-10號", "新北市新店區北新路3段127號 ", "新北市新店區北新路1段285號 ", "新北市新店區北新路二段４３號", "新北市新店區中正路４１３號１樓", "新北市新店區民權路89號", "新北市新店區北新路１段１９號１樓", "新北市新店區中正路263號", "新北市新店區中正路542-5號3樓", "新北市新店區三民路78-1號1樓", "新北市新店區民族路４９號", "新北市新店區北宜路一段84號", "新北市新店區民權路48-2號1樓", "新北市新店區北宜路一段41號", "新北市新莊區四維路171巷1號", "新北市新莊區西盛街３３８號１樓＊星期五全日休診＊", "新北市新莊區中平路306號", "新北市新莊區中和街１3號", "新北市新莊區西盛街131號", "新北市新莊區福壽街72號", "新北市新莊區中平路77號", "新北市新莊區思源路４１９巷７號  ", "新北市新莊區民安路１７６號", "新北市新莊區西盛街172號", "新北市新莊區中平路７７號", "新北市樹林區鎮前街126號", "新北市樹林區保安街一段３６４號", "新北市樹林區保安街一段65號", "新北市雙溪區中華路２９號", "新北市蘆洲區中正路３６號", "新北市蘆洲區長安街214號", "新北市蘆洲區長安街１８５號  ", "新北市蘆洲區民族路２１０號", "新北市蘆洲區長安街１８５號１樓", "新北市蘆洲區中山一路184號", "新北市蘆洲區長安街67號", "新北市蘆洲區中原路４６、４８－１號＊另打ＤＮ，發票另寄台北市", "新北市蘆洲區九芎街90巷21號", "新北市蘆洲區中正路１２６號１樓", "新北市蘆洲區長榮路51號", "新北市蘆洲區尖山路219-1號", "新北市鶯歌區國慶街138號", "新北市鶯歌區建國路161號", "新北市鶯歌區中正一路96號", "新竹市新源街１００號", "新竹市北區文雅里中正路３０９號１樓", "新竹市經國路二段268號", "新竹市西大路638號", "新竹市食品路140號", "新竹市水田街１５７號", "新竹市東區南大路４０２號", "新竹市建中路35號", "新竹市明湖路４４６之４號", "新竹市東區林森路１８８號", "新竹市水田街１５７號", "新竹市中華路二段218號", "新竹市延平北路一段245號", "新竹市食品路２６９號", "新竹市振興路５２號", "新竹市北區民富里西大路５１９號１樓", "新竹市東區明湖路９６５號", "新竹市科學園路１３３號", "新竹市中央路181號", "新竹市食品路117號", "新竹市湳雅街77號", "新竹市中華路５段４２號", "新竹市光復路二段３１０號", "新竹巿東區鐵道路２段８號", "新竹市香山區大庄路５９號１樓", "新竹市中華路二段222號  ", "新竹市西大路５０３號", "新竹縣竹北市博愛街335號", "新竹縣竹北市勝利五路176號", "新竹縣竹北市福興東路一段373號", "新竹縣竹北市中正東路２８８號", "新竹縣竹東鎮中興路三段174號", "新竹縣竹東鎮東林路８０號", "新竹縣竹東鎮長春路三段４３號", "新竹縣竹東鎮長春路三段６號", "新竹縣竹東鎮朝陽路75號", "新竹縣竹東鎮長春路三段133號  ", "新竹縣竹東鎮長春路一段２８１號  ", "新竹縣湖口鄉工業區光復東路３３５號", "新竹縣湖口鄉達生路121號", "新竹縣湖口鄉民族街126號", "新竹縣湖口鄉民族街98號", "新竹市光復路一段75號", "新竹縣湖口鄉成功路136號", "新竹縣新埔鎮中正路221號", "新竹縣新豐鄉建興路一段7號", "台中市大甲區文武路18號", "台中市大甲區蔣公路２０２號", "台中市大肚區沙田路二段636號", "台中市大肚區遊園路二段２２３－１號", "台中市大里區大明路３０６號", "台中市大里區大明路５３９號１樓、５４１號１樓", "台中市大里區東榮路４８４號", "台中市大里區益民路二段３０４號１樓", "台中市大里區中興路二段３３３號", "台中市大里區塗城路７５８號１樓", "台中市大雅區學府路２２５號", "台中市大雅區雅環路二段２０號", "台中市太平區樹德路１０２號１樓", "台中市太平區中山路２段３５７號", "台中市太平區太平路５０９號", "台中市太平區中山路二段３２７號", "台中市太平區中興路６６號", "台中市太平區東平路６１２號", "台中市中區台灣大道１段２０號", "台中市中區中華路２段６１之２號、６３號、６５號１樓", "台中市中區台灣大道１段９５號", "台中市中山路９６號", "台中市北屯區四平路４６９號１樓", "台中市北屯區平德路122巷1號", "台中市北屯區軍功路二段２３９號１樓", "台中市北屯區大鵬路３０，３２號２樓", "台中市北屯區松竹路二段１９２號", "台中市北屯區崇德路２段１２號", "台中市進化北路２７號", "台中市北屯區崇德路二段４６７號", "台中市北屯區同榮路１６３號", "台中市北屯區北平路三段三十四號二樓", "台中市北區五權路４０４號", "台中市北區五權路１５８號", "台中市北區學士路１５５號１樓", "台中市永興街１１２－１號１樓", "台中市北屯區太原路三段１４７號", "台中市西屯區寶慶路５０巷１號", "台中市西屯區中工三路１５６號１樓", "台中市西屯區河南路２段３３２號", "台中市西屯區逢甲路１４７、１４９、１５１號", "台中市西屯區河南路２段２９５號", "台中市河南路二段３５０號", "台中市西屯區福和里中工三路１９１號１樓", "台中市西屯區逢甲路９２號１樓", "台中市西屯區玉門路５０巷５之１號", "台中市青海路一段１０１、１０３號", "台中市美村路一段６７０號", "台中市南屯路一段３２號", "台中市向上路一段３５９號", "台中市西區向上路一段１６２號", "台中市南屯路一段６６之７號", "台中市西區林森路９８－２號", "台中市西區台中港路１段１０４之１０號１樓", "台中市東區進德路４１號１樓", "台中市東區十甲路５０５號", "台中市東區東英八街１０６號", "台中市南屯區向心南路９６２．９６４號１樓", "大墩南路４３１號１．２樓", "南屯路二段788號", "大業路５７１號", "黎明路二段199號", "黎明路二段432號", "黎明路一段1155號", "台中市南區忠明南路６２８號", "台中市南區台中路１５４號", "台中市南區學府路１８０號１樓", "台中市南區美村南路６８－２號１樓", "台中市中區自由路２段４５號１樓", "台中市大慶街二段３－４號", "台中市石岡區石岡街５３號", "台中市后里區甲后路４００號", "台中市后里區福容路２０１號麗寶ｏｕｔｌｅｔ櫃號３１０２", "台中市后里區民生路１２３號", "中山路286號", "中山路２８０號１樓", "沙田路146號", "台中市東勢區豐勢路２１號１樓", "台中市東勢區豐勢路４２１號", "台中市東勢區豐勢路８５號１樓", "台中市東勢區豐勢路２３２號", "中山路一段３９７號１樓", "中山路一段５號", "仁德村興祥街３號", "中央路一段907號", "梧棲路93號", "中和街126號", "台中市潭子區潭興路二段４２９號", "台中市潭子區潭興路３段９３號１樓", "台中市潭子區中山路一段１９－８號", "台中市豐原區三豐路１０１號", "台中市豐原區忠孝街４６號", "台中市豐原區台中市豐原區豐南街12號", "台中市豐原區西勢路１１５號", "台中市豐原區中正路１９６號", "台中市霧峰區中正路１１６２號", "台中市霧峰區中正路９１５號", "台中市霧峰區中正路８８０號", "台南市下營區中山路１段90號  ", "台南市下營區中山路１段２號  ", "台南市仁德區二行一路165號", "台南縣仁德鄉中正路二段３２５號", "台南市仁德區仁和里二空路９８號１樓", "台南市仁德區新田里中正路二段４６８號", "台南市永康區中山路39號", "台南市永康區國光七街71號", "台南市永康區大灣路376號", "台南市永康區民族路298號", "台南市永康區中正路９８４號　　　　", "台南市永康區復國一路496號", "台南市永康區復國一路206號", "台南市永康區中正路110號１樓", "台南市永康區復國一路206號", "台南市玉井區中華路47號", "台南市玉井區中正路238號", "台南縣白河區中正路５５號", "台南市白河區康樂路72號", "台南市白河區永安里中正路９３號１樓", "台南縣西港區新興街１２巷１４號", "台南市佳里區中山路３５９號  ", "台南縣佳里鎮光復路371號", "台南縣佳里鎮中山路２２２號", "台南市佳里區興化里佳里興４４０之２號１樓 ", "台南縣佳里鎮中山路345號", "台南市中西區中正路50號", "台南市中西區西門路二段176號", "台南市中正路２３６號", "台南市西門路二段２８５號", "台南市中西區永華路一段２３６號", "台南市民族路三段２８５號", "台南市金華路5段1號", "台南市北區公園南路357號1樓", "台南市北區北園街６－６號", "台南市北區文賢路240號", "台南市安南區安中路４段７９號", "台南市安南區安和路五段９８號１樓", "台南市安南區安中路三段431號", "台南市安南區海佃路二段572號", "台南市東區大同路二段175號", "台南東區富強里中華東路二段４９號", "台南市東區光明街36之2號", "台南市東區育樂街156之3號", "台南市東區小東路190之1號", "台南市東區崇善路654號", "台南市東區仁和路１１７之１號", "台南市南區金華路二段409號1樓", "台南市文南路１１５號", "台南市南區新興路437號", "台南市麻豆鎮興中路８８號", "台南市麻豆區興中路11號", "台南市善化區中山路１７８號", "台南市新化區中正路５４５號", "台南市新市區中正路３１９之１號", "台南市新市區中興街48號", "台南市新市區民生路57號", "台南市新營區民權路５１號", "台南市新營區民權路６３－３號", "台南市新營區新進路2段103號", "台南市新營區中山路249號", "台南市新營區大宏里民治路３之５號", "台南市新營區中山路255'257號", "台南市新營區民治路１６９－１號", "台南市新營區信義街70號", "台南市學甲區建國路82號", "台南市歸仁區大智街１０號 ", "台南縣歸仁鄉中山路二段７１號", "台南市關廟區中正路947號", "台南市鹽水區三福路51號", "南投縣名間鄉南雅街１０２號", "南投縣竹山鎮集山路三段９４２號", "南投縣竹山鎮雲林路４１號", "南投縣竹山鎮大明路１４９－５號", "南投縣南投市復興路75-1號", "南投縣南投市民族路２２７號", "南投縣埔里鎮南盛街１４９號", "南投縣埔里鎮中山路二段４１８號", "南投縣埔里鎮南興街２７０號", "南投縣埔里鎮中山路２段３６７號", "南投縣草屯鎮中正路７６８號", "南投縣草屯鎮中山街４１２號", "南投縣草屯鎮中山街２１１號", "南投縣草屯鎮芬草路一段３５號", "南投縣集集鎮民生路２３７號", "屏東縣九如鄉九如路二段１３１號", "屏東縣內埔鄉東寧村南寧路２號", "屏東縣內埔鄉文化路382號", "屏東縣內埔鄉仁和路７號", "屏東縣里港鄉永春路６５號", "屏東縣里港鄉永春路８號", "屏東縣東港鎮中正路８３號", "屏東縣東港鎮中山路５６號", "屏東縣東港鎮新生三路138號", "屏東縣東港鎮中正路一段９２號", "屏東縣枋寮鄉中山路８５號", "屏東縣枋寮鄉中山路１１５之２號", "屏東縣林邊鄉中林路１２３號", "屏東縣長治鄉繁隆村中山路１０號", "屏東縣南州鄉溪南村三民路１４９號１樓", "屏東縣屏東市廣東路６２３號", "屏東縣屏東市中華路8號", "屏東縣屏東市廣東南路65號", "屏東縣屏東市逢甲路２６號", "屏東縣屏東市逢甲路85號", "屏東縣屏東市民族路７０號", "屏東縣屏東市中正路１６７－１號  ", "屏東縣屏東市民生路116號", "屏東縣屏東市平和里仁愛路59號1樓", "屏東縣屏東市金泉里漢口街１１號", "屏東縣屏東市復興一路321號", "屏東縣屏東市棒球路47號", "屏東縣屏東市中正路３９８號", "屏東縣高樹鄉南興路４９－７及４９－８號", "屏東縣萬丹鄉萬安村萬丹路１段１５８號", "屏東縣萬丹鄉萬安村和平西路５號", "屏東縣萬丹鄉社皮村大昌路４５８號", "屏東縣萬丹鄉社中村社皮路三段４２８號、４３０號", "屏東縣萬巒鄉新置村新隆路48號", "屏東縣潮州鎮新生路３６之１號", "屏東縣潮州鎮延平路１６８號", "屏東縣麟洛鄉中山路256-1號", "屏東縣鹽埔鄉新二村彭厝路38-5號", "苗栗縣竹南鎮光復路４０號  ", "苗栗縣後龍鎮中華路６４－１號", "苗栗縣苑裡鎮苑南里天下路８０之６７號", "苗栗縣苗栗市中正路７４８號", "苗栗縣苗栗市中正路908號", "苗栗縣苗栗市府前路９１號", "苗栗縣通霄鎮信義路１０４號", "苗栗縣銅鑼鄉中正路１２８號", "苗栗縣頭份鎮尖山里尖豐路３２號", "苗栗縣頭份鎮信東路１３５號", "苗栗縣頭份鎮信東路３９號", "苗栗縣頭份鎮仁愛路８６號", "苗栗縣頭份鎮民族路２８號", "苗栗縣頭份鎮民族里東興路６６號１樓", "高雄市三民區澄和路６６號", "高雄市三民區大昌二路２４８號", "高雄市三民區鼎山街665號", "高雄市三民區鼎力路３７8號", "高雄市三民區建興路222號", "高雄市三民區九如二路324號", "高雄市三民區鼎中路530號", "高雄市三民區明誠一路492號", "高雄市三民區天祥一路117號", "高雄市三民區澄清路639號1樓", "高雄市三民區陽明路192號", "高雄市大社區中山路４２３號", "高雄市大社區中山路２０１號", "高雄市大社區中山路343號", "高雄市大寮區鳳林三路４０８之１號", "高雄市大寮區鳳林三路８３５號", "高雄市大寮區鳳屏一路514號", "高雄市大寮區鳳屏一路４18號1樓", "高雄市大寮區鳳林四路268號", "高雄市小港區孔鳳路５６１號", "高雄市小港區二苓路247號", "高雄市仁武區中華路40號", "高雄市仁武區永仁街３２１號", "高雄市仁武區中正路１６７，１６９號", "高雄市仁武區大灣村大景二街99號", "高雄市仁武區八德中路88號", "高雄市仁武區仁雄路89-3號", "高雄市左營區大路３９０號", "高雄市左營區左營大路５１４號  ", "高雄市左營區重愛路２２０號", "高雄市左營區大路４１－１號", "高雄市左營區自由二路90號", "高雄市左營區榮總路23號１樓", "高雄市左營區富國路339號１樓", "高雄市左營區榮耀街1-3號", "高雄市左營區左營大路６８號", "高雄市左營區崇德路２６７號", "高雄市左營區果峰街12巷26號  １樓", "高雄市左營區裕誠路144號", "高雄市左營區裕誠路1680號", "高雄市左營區民族一路1028-1號", "高雄市左營區裕誠路370號", "高雄市左營區文自路930號", "高雄市左營區華夏路622號", "高雄市左營區華夏路1110號", "高雄縣岡山區平和路１４２號", "高雄市岡山區中山北路39號", "高雄市岡山區仁壽路３８－１號", "高雄市岡山區維仁路１４７號  ", "高雄市岡山區前鋒路183-2號", "高雄市林園區林園北路118號", "高雄市林園區東林西路４９號", "高雄市林園區東林西路210號", "高雄市阿蓮區中山路８８號", "高雄巿前鎮區保泰路351號", "高雄市前鎮區瑞隆路253號", "高雄市前鎮區前鎮街１７０號", "高雄市前鎮區草衙李天后街２９號６樓之２", "高雄市前鎮區瑞隆路３９３號", "高雄市前鎮區中華五路789號", "高雄市美濃區中正路一段３１之１號", "高雄市苓雅區自強三路９５號", "高雄市苓雅區正義路１８０之６號", "高雄市苓雅區英祥街19號", "高雄市苓雅區輔仁路175號", "高雄市苓雅區福德二路２０號", "高雄市苓雅區和平一路143-7號", "高雄市苓雅區光華一路３５號", "高雄市苓雅區和平一路１４７之５號", "高雄市苓雅區鳳山區經武路１７８號  ", "高雄市苓雅區武廟路９８號", "高雄市苓雅區青年一路１６７－３號", "高雄市苓雅區廣州二街117號", "高雄市梓官區城隍巷31號", "高雄市梓官區光明路１４號", "高雄市梓官區梓官路城隍巷２２之１號", "高雄市湖內區中山路一段451之19號", "高雄市新興區自立一路55號", "高雄市新興區中山一路173號", "高雄市新興區七賢二路145號１樓", "高雄市楠梓區楠梓東街７４號", "高雄市楠梓區萬昌街１１１號", "高雄市楠都西巷138號", "高雄市楠梓區右昌街１９１號", "高雄市後昌路1079號１樓", "高雄市楠梓區軍校路６７２號", "高雄市右昌街226號", "高雄市楠梓區和光街１９１號", "高雄市楠梓區德民路９１１號", "高雄市楠梓區土庫路68號", "高雄市楠梓區德賢路191號", "高雄市楠梓區軍校路882號", "高雄市路竹區中正路１１６號", "高雄市鼓山區九如四路1460巷4號", "高雄市鼓山區鼓山三路４８－１１號", "高雄市鼓山區九如四路１４２６號", "高雄市鼓山區華榮路295號", "高雄市鼓山區明倫路150號1樓", "高雄市鼓山區美術東2路77號", "高雄市旗山區中山路92號", "高雄市旗山區中山路１１號", "高雄市旗山鎮延平一路５４５號", "高雄市鳳山區青年路一段３０５號", "高雄市鳳山區新強路８３號", "高雄市鳳山區鳳北路３６－１號", "高雄市鳳山區五甲一路5號", "高雄市鳳山區五甲二路３４２號１Ｆ", "高雄市鳳山區鳳林路166號", "高雄市鳳山區新興里光遠路２０５號  ", "高雄市鳳山區光遠路４２４號", "高雄市鳳山區青年路二段289號", "高雄市鳳山區新富路428號", "高雄市橋頭區橋頭里成功路２２９號", "高雄市鹽埕區大仁路１０２號１樓", "高雄市建國四路387號", "雲林縣土庫鎮油車村文化路236號", "雲林縣土庫鎮中正路２０２號", "雲林縣土庫鎮中正路１１號", "雲林縣土庫鎮北平里民權路１４號", "雲林縣大埤鄉鄉南和村中正路５２之２號", "雲林縣斗六市上海路236號", "雲林縣斗六市中山路９號", "雲林縣斗六市中華路１６１號", "雲林縣斗六市中山路308號", "雲林縣斗六市太平路９７號", "雲林縣斗南鎮文元街43號", "雲林縣斗南鎮延平路２段２６４號", "雲林縣水林鄉水南村水林路１３０號", "雲林縣北港鎮文化路１６６號", "雲林縣西螺鎮延平路２３４號", "雲林縣西螺鎮平和路77-2號", "雲林縣東勢鄉民生路６７號", "雲林縣林內鄉中正路246號", "雲林縣虎尾鎮林森路一段３２９號", "雲林縣虎尾鎮林森路一段３６６號", "雲林縣崙背鄉信義路８８號", "雲林縣麥寮鄉橋頭村仁德路１１８號", "雲林縣莿桐鄉中山路１０６號", "雲林縣褒忠鄉中正路４５２號", "嘉義市民生南路574號", "嘉義市世賢路一段549號", "嘉義市西區西平里玉山路１４５號１樓", "嘉義市博愛路二段361號", "嘉義市中山路１９３號", "嘉義市民權路87號", "嘉義市興業西路381號", "嘉義市垂楊路501號", "嘉義市東區義教里保建街１６１號", "嘉義市西區中正路６９７號", "嘉義市東區安寮里興業東路５６號１樓", "嘉義市林森東路300號", "嘉義市寬士村崎仔頭1之300號", "嘉義市民族路202號", "嘉義市美源里新民路６３６號", "嘉義縣大林鎮中正路３３８號", "嘉義縣大林鎮民權路３６號", "嘉義縣民雄鄉福樂村埤角１３９號", "嘉義縣朴子市中正路１９０號", "嘉義縣朴子市平和里海通路１１─２號", "嘉義縣朴子市中興路６５號", "嘉義縣竹崎鄉中山路184號", "嘉義縣竹崎鄉灣橋村五間厝３－２號１樓", "嘉義縣新港鄉公園路68號", "嘉義縣溪口鄉中正路１９３號", "彰化縣二水鄉員集路三段640號", "彰化縣二水鄉斗苑路四段669號", "彰化縣二水鄉中山路１４０號", "彰化縣北斗鎮中山路二段32.34號", "彰化縣永靖鄉西門路41號", "彰化縣伸港鄉新港村信義路１３５號", "彰化縣秀水鄉中山路345號", "彰化縣秀水鄉安東村中山路282-1號", "彰化縣和美鎮線東路4段156號", "彰化縣和美鎮彰美路六段133號", "彰化縣和美鎮愛民路106號", "彰化縣和美鎮彰新路二段535號", "彰化縣和美鎮中正路８０號", "彰化縣和美鎮美寮路二段716號", "彰化縣社頭鄉清水岩路371號", "彰化縣芬園鄉社口村芬草路二段230號", "彰化縣芬園鄉彰南路四段１０８巷１２號", "彰化縣花壇鄉中山路二段159號", "彰化縣花壇鄉中正路200號", "彰化縣花壇鄉花壇街249號", "彰化縣花壇鄉長沙村中正路９１號１樓", "彰化縣員林市惠來街87號", "彰化縣員林市中正路259號", "彰化縣員林市中山路一段６２７號", "彰化縣員林市中正路306號", "彰化縣員林市員東路二段189號", "彰化縣員林市育英路174號", "彰化縣員林市中山路一段727號", "彰化縣員林鎮三民東街252號", "彰化縣員林市大同路二段182-1號", "彰化縣埔心鄉東門村員鹿路二段329號  ＊中午１２－１３時休", "彰化縣埤頭鄉斗苑西路261號", "彰化縣埤頭鄉彰水路三段５３４巷２８號", "彰化縣鹿港鎮大明路48號", "彰化縣鹿港鎮頂番里鹿和路四段１５號", "彰化縣鹿港鎮民權路115-1號", "彰化縣鹿港鎮中山路380號", "彰化縣溪湖鎮彰水路3段376號１樓", "彰化縣彰化市中華西路111號", "彰化縣彰化市民生路103號", "彰化縣彰化市成功里大埔路695號", "彰化縣彰化市旭光路291號", "彰化縣彰化市華山路173號", "彰化縣彰化市中正路二段２２４號  ", "彰化縣彰化市中山路一段556巷10號", "彰化縣彰化市員鹿路一段５５７號"],
            p_storePhone: ["02-28320379","02-27618155","02-28380306","02-28725144","02-88662188","02-28720208","02-28128195","02-28320375","02-28882169","02-28882158","02-8358558","02-8367202","02-28855990","02-28882156","02-28716511","02-88115559","02-28348756","02-28336362","02-28385850","02-28831079","02-8815988","02-28346453","02-28166977","02-25583392","02-25538988","02-25561925","02-25557985","02-2672-0787","02-25957025","02-25976937","02-25977932","02-25575995","02-25556484","02-25568039","02-25978628","02-27050799","02-27331456","02-23250686","02-27540070","02-23256668","02-27071221","02-27817891","02-27403767","02-27060580","02-23770089","02-27752551","02-23623479","02-3627307","02-27321818","02-27076502","02-27520273","02-27515678","02-25232803","04-25228490","02-25323296","02-25964593","02-25711742","02-25034281","02-27772740","02-25038205","02-25320522","","02-25236979","02-25182229","02-25969580","02-25324769","02-3683618","02-23689200","02-2389977","","02-23311595","02-3817504","02-23615654","02-23689889","02-23514576","02-3713838","02-23117779","02-23961979","02-23039829","02-23117102","02-23117744","02-23939339","02-23390625","02-23815229","02-27915726","02-26562110","02-26305743","02-26305157","02-287912187","02-27996446","02-26595430","02-7998042","02-26279291","02-27370338","02-29302801","02-29334580","02-29385363","02-29319510","02-22304866","02-29312597","02-89321707","02-29348662","02-28912675","","02-28263580","02-28946520","02-28230637","02-28916668","02-28253258","02-28912339","02-28279996","02-27602932","02-27782829","02-27471749","02-27422743","02-27124696","02-25775000","02-27524155","02-7623522","02-27618155","02-25706677","02-27222236","02-77296777","02-27594416","02-27582378","02-23455186","02-23460521","02-27687754","02-87323331","02-27271401","02-27272502","02-27337099","02-87891622","02-27828810","02-27836222","02-27867002","02-26547322","02-27885951","02-27838090","02-27838090","","02-23037855","02-23011598","02-23710577","02-23062975","02-23063083","02-23050880","02-23022111","02-23718892","02-23074599","03-9656584","03-9387928","03-9362880","03-9369769","03-9327893","03-9322369","03-9322678","03-9332415","03-9770618","03-9882857","03-9543649","03-9553222","03-9541160","03-9371516","03-9544697","03-9965076","03-9962869","03-8882333","03-8889408","03-8882530","04-22230388","03-8578969","03-8323026","03-8322606","03-8311982","03-8531432","03-8329859","03-8323031","03-8230595","03-8571950","03-8331208","03-8322676","03-8267211","03-8870184","03-3665371","03-3631517","03-4783161","03-3756939","03-3970761","03-3662930 ","03-3867448","03-3807-999","03-3882276","03-3882206","03-4638812","03-4628651","03-4226358","03-4595111","03-4637687","03-4685899","03-4278266","03-4661839","03-4253038","","03-4259643","03-4511208","03-4250641","03-4564946","03-4686738","03-4565562","03-4688239","03-4514505","03-4922716","03-4194550","03-4824839","03-4396011","03-4683247","03-3266654","03-3170681","03-3368758","03-2170172","","03-3474765","03-3319621","03-3355575","03-3614007","03-2171836","03-3323846","03-3638510","03-3016639","03-3355001","03-36096339","03-3335977","03-4870528","","03-2889590","03-4311995","03-4757775","03-4852081","","03-4852081","03-4423026","03-4993793","034091005","03-489-9639","03-4992236","03-480-3831","034804825","034794412","03-4801508","034808824","","(03)328-4108.","03-3885511","(03)397-2052","03-2126642","033116868","033139657","03-2120206","033129045","03-4833015","34984488","","02-24628789","02-24202827","02-25775000","02-24222978","02-24223760","02-24258762","02-24321739","02-24344550","02-26101072","","02-89824272","02-287-9836","02-29769055","02-29717291","02-29786003","02-29894735","02-29886892","02-29856852","02-29763895","02-29715020","02-287-7692","02-29827688","02-82871076","02-29857456","02-29724765","02-29813155","02-29717277","02-29788120","02-26738535","02-86712269","02-26711125","02-26739797","02-26711560","02-22606812","02-22668525","02-22610590","02-22630230","02-22648655","02-22656056","02-22626870","02-82619585","02-22655056","02-22622588","02-22626111","02-22733868","02-22265758","02-82218338","02-29485177","02-22235319","02-29426196","02-29590964","02-29590964","02-22451379","02-22265758","02-22257728","02-29203865","02-22921143","02-22915932","02-22925067","02-29432239","02-22318585","02-29263191","02-29282000","02-29272767","02-29288118","02-29211798","02-29291655","02-89431417","02-29461128","02-29242484","02-29264391","02-26927733","02-26962999","02-6422048","02-26924087","02-86916091","02-27892200","02-2522204","02-82520408#105","02-29543930","02-22593926","02-22540613","02-26818663","02-29567309","02-22783277","02-22566497","02-89674888","02-22580963","02-29560576","02-29610311","02-29655351","02-22510338","02-9602748","02-22725358","02-22547482","02-29670258","02-22536951","02-29637248","02-22540613","02-22530009","02-22972121","02-29095662","02-26295693","02-26211448","02-8098022","02-77230208","","","02-86312050","02-2625-5847","02-8911-6029   ","02-29151709  ","02-89147015","02-86655462","02-29127861","02-89115998","02-29175888","02-22189610","02-89146301","02-9125526","02-29183565","02-86655371 ","02-29186266","02-22025576","02-22085138","02-29924496","02-89929482","02-22065185","02-22774399","02-29901680","02-29945270","02-2063806","02-22080528","02-29901680","02-6810386","02-86875503","02-26871276","02-24931085","02-22818227","02-8477845","02-22887676","02-282866803","02-22887676","02-22893899","02-22830704","","02-22827527","02-82867383 ","02-82863837","02-26011312","02-26709693","02-86775363","02-26792356","03-5740112","03-5334827","","03-5233111","03-5621111","03-5314948","03-7598995","","03-5191010","03-5256938","03-5314948","03-5321636","03-5228968","03-5619753","03-5625398","03-5245838","03-5290999","03-5780595","","","03-5315188","03-5381552","03-5719019","03-5152255","03-5306645","03-35355767","03-5232361","03-55552288","","03-6583777","03-5518093","03-5836490","03-5940019","03-5963549","03-5960360","03-5104721","03-5103818","03-5962335","03-5972606","","03-6992365","","","","","","04-26804212","04-26765518","04-26992116","04-26910209","04-24876247 ","04-24068864 ","04-24817636","04-24815932","04-24852072","04-24935888 ","04-25609333","04-25653456","04-23981782","04-23935050","04-22755053","04-23920685","04-22787987","04-22783697","04-22234996","04-22016306","04-22207700","04-22222154","04-24223378","04-22924710","04-24391646","04-22924966 ","04-22493138","04-22364635","04-2340208","04-22464485","04-24260588 ","04-22350168","04-22068113","04-22225688","04-22076279","04-22358880","04-22369603","04-24518597","04-23583373","04-27068798 ","04-27085922","04-24525052","04-27022702 ","04-23586332","04-27087952","04-24638302","04-23118560","04-23766127","04-23714995","04-24756688","04-23017100","04-23763133","04-22980342","04-22079309","04-22114206","04-22131348","04-22129298","04-24710219","04-24710655","04-23899603","04-22516715","04-23849128","04-22510951","04-23818218","04-23751551","04-22874588","04-22187028","04-22653346","04-22222160","04-22611769","04-25722833","04-556-1017","04-25583390","04-25570225","04-26625339","04-26633758","04-26626826","04-25885778","04-5876245","04-25887639","04-25873969","04-23356118","04-23372133","04-23360401","04-26561755","04-26563249","04-26584836","04-25367109","04-5358077","04-25350918","04-25228490","04-25226700","04-25337605","04-25262681","04-25256333","04-23391346","04-23301002","04-23328875","06-6891723","06-6892088","07-6995796","06-2794623","06-2680608","06-2798003","06-2325057","06-2718968","06-2398273","06-2728774","06-2533478","06-2030463","06-3121328","06-7034571","06-3121328","06-5742271","06-5743036","06-6831128","06-6857379","06-6856700","06-7952617","06-7212723","06-7221369","06-7223780","06-7262936","06-7229550","06-2223129","06-2222750","06-2200106","06-2226046","06-2292789","06-2200881","06-2295533","06-2226899","06-3351295","06-2583180","06-2562317","06-3561305","06-2567798","06-2555388","06-2153777","06-3361683","06-2376448","06-2360088","06-2378697","06-2678421","06-2676256","06-2653088","06-2610628","06-2651423","06-5727475","","06-5838245","06-5907185","06-5997603","07-5824083","06-5014888","06-6333479","06-6332833","06-6354620","06-6322458","06-6358209","06-6322366","06-6571188","06-6376863","06-7835087","06-2301360","06-2399212","","06-6521071","0492732678","049 2632984","049 2651032","049 2630355","0492227009","049 2222601","049 2989530","049 2982042","049 2992837","492999218","049 2333228","0492353793 ","049 2333570","049 2305685","049-2760565","08-7393672","08-7788919","08-7693929","08-7792121","08-7752051","08-7756104","08-8322616","08-8322818","08-8354752","08-8351177","08-8781593","08-8785700","08-8752028","08-7621326","08-8646868","08-7352108","08-7322519","08-7512530","08-7322413","08-7323293","08-7323106","08-7328052","08-7224861","08-7320680","08-7322332","08-7550277","08-7515817","08-7350558","08-7967883","08-7772046","08-7762889","08-7072876","08-7075529","08-7850153","08-7883401","08-780-5759","08-7213590","08-7935513","037-479933","037-721952","037-862003","037-320145","037-320285","037-320685","037-750000","037-986388","036-633632","037-598995","037-663580","037-666101","037-664367","037-681880","07-3923111","07-3837833","07-3825577","07-3473271","07-3845050","07-3215681","07-3109479","07-3107072","07-3102683","07-3815186","07-3945146","07-3531053","07-3542200","07-3520061","07-7816570","08-7819515","07-7034256","07-7030096","07-7862818","07-7912331","07-8011846","07-3757869","07-3728289","07-3712815","07-3710807","07-3736437","07-3743243","07-5817895","07-5827329","07-3458378","07-5815069","07-5584259","07-3596913","07-5508862","07-3596429","07-5814618","07-3419363","07-5855767","07-5582806","07-5524680","07-3100696","07-5573857","07-3501870","07-3460931","07-3410915","07-6214459","07-6230222","07-6264538","07-6212163","07-6250942","07-6412641","07-6412456","07-6429592","07-6313928","07-7159533","07-7225055","07-8216030","07-8114803","07-7619334","07-8232378","07-6818321","07-3355113","07-7490883","07-7522786","07-7119786","07-7779771","07-7219332","07-3313535","07-7719152","07-7468840","07-7151149","07-5368701","07-7220808","07-6172407","07-6101060","07-6102767","07-6938208","07-2885454","07-2859635","07-2853395","07-3513339","07-3653534","07-3539869","07-3626893","07-3685545","07-3652942","07-3612640","07-3643352","07-3630805","07-3535458","07-3661348","07-3643074","07-6231391","07-5815858","07-5612677","07-5833228","07-5521019","07-5520736","07-5521007","07-6622565","07-6612057","07-6623545","07-7482246","07-7671343","07-7465530","07-7450309","07-7117100","07-7825213","07-7462525","07-7468029","07-7676179","07-765-2243","07-6113632","07-5518440","07-5514652","05-5989955","05-6624778","05-6622889","05-6651758","05-5913677","05-5349507","05-5322438","05-5322402","05-5347619","05-5322036","05-5972134","05-5953727","05-7852721","05-7820005","05-5862222","05-5873287","05-6991031","05-5899896","05-6314168","05-6326456","05-6962769","05-6913861","05-5842824","05-6976066","05-2355588","05-2910585","05-2843514","05-2687897","05-2330230","05-2754836","05-2861880","05-2861880","05-2168905","05-2252733","05-2168905","05-2777900","0934-396558","05-2168605","05-2285812","05-2652127","05-2654246","05-2201138","05-3792265","05-3792664","05-3704552","05-2611016","05-2792226","05-3748533","05-2691218","04-8792593","04-8956818","04-8954029","04-8881669","04-8221821","04-7992663","04-7689699","04-7686649","04-7567339","04-7569718","04-7566092","04-7330458","04-7552334","04-7559952","04-8732473","04-92522858","04-92522391","04-7882818","04-7862361","04-7863990","04-7880073","04-8367007","04-8378553","04-8321553","04-8320990","04-8360617","04-8324986","04-8320627","04-8330918","04-8358827","04-8280957","04-8922162","04-8926166","04-7772391","04-7713497","04-7755540","04-7773078","04-8613668","04-7635422","04-7227761","04-7113332","04-7234725","04-7291519","04-7233018","04-7234408","04-7782098"],
            storeChannel: 1,
            storeCity1: '',
            storeCity2: '',
            citiSelectedIndex: 0,
        },
        qaData: {
            activeIndex: 1,
            qas: [{
                q: "合利他命EX PLUS強效錠是甚麼產品?",
                a: "針對緩解「眼睛疲勞」、「腰背酸痛」、「肩頸僵硬」等酸痛症狀而設計。"
            }, {
                q: "產品在甚麼地方製造?",
                a: "合利他命EX PLUS強效錠是由日本武田藥品研發，於日本製造及包裝，再原裝進口至台灣，成分與日本出售的相同。"
            }, {
                q: "甚麼是TTFD?",
                a: "武田藥品研發的TTFD是維他命b1衍生物(又稱維他命B1誘導體)，能令維他命B1更容易被吸收，並有效作用於神經與肌肉組織，從根源緩解痠痛。"
            }, {
                q: "什麼是泛酸鈣?",
                a: "參與能量代謝，用於燃燒脂肪、膽固醇的合成及胺基酸的代謝，是輔酵素A的成分之一。"
            }, {
                q: "什麼是γ-穀維素？",
                a: "可協助維生素B1、B6、B12發揮作用。"
            }, {
                q: "每天一次，我應該什麼時候服用？",
                a: "請在飯後服用，在早上、中午或晚上，都是有效的。"
            }, {
                q: "服用多久才有效?",
                a: "服用效果依個人體質及吸收能力而有效果，建議持續服用一個月，若情況未有改善，建議徵詢醫師意見，進一步了解酸痛背後原因。"
            }, {
                q: "在用蒜嗎？",
                a: "合利他命EX PLUS強效錠不含大蒜成份所使用的Fursultiamine(維生素B1誘導體)，其特殊氣味與大蒜相似，導致部分消費者誤以為含有大蒜成份。"
            }, {
                q: "適合甚麼年齡服用?",
                a: "15歲以上即可服用。"
            }, {
                q: "為何台灣販售的合利他命EX PLUS強效錠所標示的劑量跟台灣買的不一樣?",
                a: "台灣販售的合利他命EX PLUS強效錠與日本當地販售的EX PLUS成分、劑量、用法用量完全無調整。日文版所標示的劑量是 3 錠的總含量，台灣標示的是每 1 錠之含量，將該劑量乘以3便等於日文版的劑量"
            }, {
                q: "為什麼在一些藥局或是在網路上也可以買到全日文標示的合利他命EX PLUS強效錠?",
                a: "請認明包裝上印有台灣武田、有中文標示的合利他命EX PLUS強效錠，才是合法自日本原裝進口的產品，從生產到配送嚴格依照法規管控品質，保障消費者用藥安全。全日文版本之產品並非台灣武田公司進口之包裝，亦非衛福部核准之產品，其商品來源與品質均缺乏保障。"
            }]
        },
        posIndex: -1,
        isLoaded: false,

    },
    computed: {
        citiSelect2() {
            var index = this.storeData.citi1Arr.indexOf(this.storeData.storeCity1);

            return (index == -1) ? [] : this.storeData.citiArr2[index];
        },
        showCitiArr() {
            var arr = [];
            var {
                p_storeName,
                p_storeArr,
                p_storePhone,
                storeCity1,
                storeCity2
            } = this.storeData;
            if (storeCity1 == '' && storeCity2 == '') {
                return arr
            }
            p_storeArr.forEach((el, index) => {
                if (el.indexOf(storeCity1) != -1 && el.indexOf(storeCity2) != -1) {
                    arr.push({
                        name: p_storeName[index],
                        addr: el,
                        phone: p_storePhone[index]
                    })
                }
            });
            return arr
        }
    },
    watch: {
        // posIndex(val){
        //     console.log('posIndex' + val);
        //     $('.pageNavWrap .pageNav').eq(val-1).addClass('active').
        // }
    },
    mounted() {
        this.isPhone = ChungTool.isPhone();
        console.log('ChungTool.isPhone(): ', ChungTool.isPhone());
        var that = this;
        var header = $('#header');
        var point1 = $('#sticky-point');
        var point2 = $('#sticky-point2');
        var sickMenu = $('#sickMenu');
        var mt = 0;
        
        setInterval(function () {
            let top = $(window).scrollTop();
            if (top > 200) {
                header.addClass('redBg');
            } else {
                header.removeClass('redBg');
            }
            if (that.isPhone) {
                let sickTop = top - point1.offset().top + 70;
                let height = sickMenu.height();
                let height2 = top - point2.offset().top + height + 70;

                if (sickTop > 0) {
                    sickMenu.addClass('sticky');
                    point1.css('height', height + 'px');
                    sickMenu.css('top', Math.min(70, -height2))
                } else {
                    sickMenu.removeClass('sticky');
                    sickMenu.css('top', 0)
                    point1.css('height', 0);
                }
            }

            var posIndex = 0;
            $('.page-point').each(function(index,el){
                var pos = top-$(el).offset().top;
                posIndex = (pos + 500 > 0 )? index + 1 : posIndex;
            });
            that.posIndex = posIndex;
        }, 10)

        
        //load
        $('.loadingFirst').waitForImages({
            finished: function() {
                that.isLoaded = true;
                that.playAni();
            },
            each: function(loaded, count, success) {
                var r = Math.floor(loaded / count * 100);
            },
            waitForAll: true
        }); 

        $('.my-paroller').paroller();
    },
    methods: {
        limitRange(num, min, max) {
            return Math.max(Math.min(num, max), min)
        },
        playAni() {
            
            var tl = new TimelineMax({delay:.3});

            tl.set('.ani_items',{autoAlpha:0})
            .fromTo('#ani_man',.8,{bottom:-200},{bottom:0,autoAlpha:1})
            .staggerFromTo('.ani_t',1.6,{left:60},{left:0,autoAlpha:1,ease:Power3.easeOut},.2,'-=.4')
            .fromTo('#ani_balls',.6,{marginTop:0},{marginTop:-30,autoAlpha:1},'-=1.2')
            .fromTo('#ani_pro',1,{marginLeft:200},{marginLeft:0,autoAlpha:1},'-=.8')
            .fromTo('#ani_proTxt',.6,{marginLeft:-50},{marginLeft:0,autoAlpha:1},'-=.6')
        }
    }

})