var app = new Vue({
    el: '#app',
    data: {
        videoPop: false,
        sickChannel: 1,
        showPhoneMenu: false,
        isPhone: false,
        showConfig: {
            talkPop: false,
            proBox: false,
        },
        storeData: {
            swiperOption: {
                slidesPerView: 3,
                slidesPerColumn: 2,
                spaceBetween: 30,
                pagination: {
                    el: '.swiper-pagination',
                    clickable: true
                },
                breakpoints: {
                    640: {
                        slidesPerView: 1,
                        spaceBetween: 10
                    },
                    1024: {
                        slidesPerView: 2,
                        spaceBetween: 20
                    }
                },
                navigation: {
                    nextEl: '#pycialStores-wrap .swiper-button-next',
                    prevEl: '#pycialStores-wrap .swiper-button-prev'
                }
            },
            swiperOption2: {
                slidesPerView: 2,
                slidesPerColumn: 3,
                spaceBetween: 0,
                breakpoints: {
                    1024: {
                        slidesPerView: 1,
                        spaceBetween: 0
                    }
                },
                navigation: {
                    nextEl: '#pharmacyStores-wrap .swiper-button-next',
                    prevEl: '#pharmacyStores-wrap .swiper-button-prev'
                }
            },
            pycialStores: [{
                    name: 'Watsons',
                    img: './images/m01.png',
                    url: 'https://www.watsons.com.tw/store-finder'
                },
                {
                    name: 'Cosmed',
                    img: './images/m02.png',
                    url: 'https://www.cosmed.com.tw/Contact/Shop.aspx'
                },
                {
                    name: 'Tomod’s',
                    img: './images/m03.png',
                    url: 'http://www.tomods.com.tw/stores'
                },
                {
                    name: '躍獅',
                    img: './images/m04.png',
                    url: 'http://dms.yeschain.com.tw/location.php?no=74&menu=6,74,74'
                },
                {
                    name: '大樹',
                    img: './images/m14.png',
                    url: 'http://www.greattree.com.tw/store.aspx'
                },
                {
                    name: '佑全/健康人生',
                    img: './images/m05.png',
                    url: 'http://www.yourchance.com.tw/index.php?temp=store&lang=cht'
                },
                {
                    name: '丁丁',
                    img: './images/m06.png',
                    url: 'https://www.norbelbaby.com.tw/TinTin/work.jsp'
                },
                {
                    name: '啄木鳥',
                    img: './images/m07.png',
                    url: 'https://www.woodpecker.com.tw/info/location'
                },
                {
                    name: '杏一',
                    img: './images/m08.png',
                    url: 'https://www.medfirst.com.tw/website_module_detail.php?website_module_classify_sn=100&website_module_sn=45'
                },
                {
                    name: '維康',
                    img: './images/m09.png',
                    url: 'http://www.wellcare.com.tw/wellindex/03map.htm'
                },
                {
                    name: '信東',
                    img: './images/m10.png',
                    url: 'http://www.sintong.com/tw_profile.php?Kid=103&Aid=103001&PHPSESSID=9609107199ff1341c00bb29c8560fc12'
                },
                {
                    name: '愛買',
                    img: './images/m11.png',
                    url: 'https://www.fe-amart.com.tw/index.php/store'
                },
                {
                    name: '日藥',
                    img: './images/m13.png',
                    url: 'http://www.jpmed.com.tw/shopinfo                       '
                },
                {
                    name: '美康',
                    img: './images/m12.png',
                    url: 'http://www.mecome.com.tw/front/bin/ptlist.phtml?Category=357323'
                }

            ],
            citi1Arr: ["台北市", "宜蘭縣", "花蓮縣", "桃園市", "基隆市", "新北市", "新竹市", "新竹縣", "台中市", "台南市", "南投縣", "屏東縣", "苗栗縣", "高雄市", "雲林縣", "嘉義市", "嘉義縣", "彰化縣"],
            citiArr2: [
                ["士林區", "大同區", "大安區", "中山區", "中正區", "內湖區", "文山區", "北投區", "松山區", "信義區", "南港區", "萬華區"],
                ["礁溪鄉", "宜蘭市", "羅東鎮", "五結鄉", "蘇澳鎮", "頭城鎮"],
                ["玉里鎮", "花蓮市", "吉安鄉", "瑞穗鄉", "新城鄉"],
                ["龍潭區", "蘆竹區", "中壢區", "桃園區", "楊梅區", "八德區", "平鎮區", "大溪區", "龜山區", "大園區", "新屋區", "觀音區(新坡)"],
                ["仁愛區", "安欒區", "中正區"],
                ["中和區", "新店區", "三峽區", "淡水區", "板橋區", "三重區", "蘆洲區", "土城區", "新莊區", "永和區", "樹林區", "汐止區", "五股區", "鶯歌區", "雙溪區", "泰山區", "八里區"],
                ["東區", "北區", "香山區"],
                ["竹東鎮", "竹北市", "湖口鄉", "新埔鎮", "新豐鄉"],
                ["中區", "太平區", "大里區", "東勢區", "大甲區", "梧棲區", "大雅區", "南屯區", "東區", "北區", "北屯區", "后里區", "南區", "大肚區", "西屯區", "沙鹿區", "烏日區", "西區", "潭子區", "豐原區", "石岡區", "霧峰區"],
                ["新營區", "北區", "永康區", "南區", "東區", "仁德區", "善化區", "學甲區", "中西區", "麻豆區", "鹽水區", "玉井區", "安南區", "白河區", "佳里區", "歸仁區", "西港區", "新市區", "下營區", "關廟區", "新化區"],
                ["竹山鎮", "南投市", "草屯鎮", "埔里鎮", "集集鎮", "名間鄉"],
                ["屏東市", "東港鎮", "內埔鄉", "潮州鎮", "麟洛鄉", "枋寮鄉", "鹽埔鄉", "里港鄉", "林邊鄉", "長治鄉", "萬巒鄉", "南州鄉", "萬丹鄉", "高樹鄉", "九如鄉"],
                ["苗栗市", "頭份鎮", "苑裡鎮", "銅鑼鄉", "通霄鎮", "竹南鎮", "後龍鎮"],
                ["鳳山區", "苓雅區", "前鎮區", "大社區", "梓官區", "大寮區", "旗山區", "楠梓區", "三民區", "仁武區", "鼓山區", "左營區", "橋頭區", "小港區", "阿蓮區", "路竹區", "林園區", "岡山區", "新興區", "鹽埕區", "美濃區", "湖內區"],
                ["西螺鎮", "斗六市", "斗南鎮", "土庫鎮", "褒忠鄉", "水林鄉", "二崙鄉", "麥寮鄉", "林內鄉", "莿桐鄉", "大埤鄉", "崙背鄉", "虎尾鎮", "東勢鄉", "北港鎮"],
                ["西區", "東區"],
                ["朴子市", "大林鎮", "民雄鄉", "水上鄉", "竹崎鄉", "溪口鄉", "新港鄉"],
                ["二水鄉", "彰化市", "花壇鄉", "永靖鄉", "員林市", "鹿港鎮", "埔心鄉", "北斗鎮", "伸港鄉", "和美鎮", "秀水鄉", "芬園鄉", "埤頭鄉", "社頭鄉", "福興鄉", "二林鎮", "溪湖鎮"]
            ],
            p_storeName: ["一安堂藥局","八醫健保藥局","三商藥局","千百岳大藥局","大甲盈盈藥局","大甲福倫藥局","大明永欣藥局","大芳藥局","大雅藥局","大愛藥品公司","大業藥局","大墩何藥局","中大藥局","中心旗艦藥局","中央藥局","仁生藥局","仁康藥局","日美藥粧-台中麗寶","北屯德康藥局","台大藥局","弘映藥局","必安藥局","正三吉藥房","永旭大藥局","永富藥局","立達大藥局","全成國際藥品有限公司(總倉)","向上中西藥局","向日睽藥局","安順藥局","安德生物科技股份有限公司","成記藥局","老順安大藥局","佑昇藥局","宏信大藥局","宏信藥品股份有限公司","佳美藥局","兩隻老虎藥局","和生藥局","宜泰藥師藥局","忠信西藥房","承諭藥局","拓撲藥品股份有限公司","東生藥局","東亞大藥局","東亞藥師大藥局","東亞藥師大藥局 逢甲店","東亞藥師藥局","松竹大藥局","長映藥局","青育藥局","信和藥局","信賢藥局有限公司","恆安大藥局","泉興大藥局","皇杰藥局","美日藥局","美得康藥局-平德店","英全藥局","倫彰西藥房","原隆安藥局","浤泰大藥局","真安大藥局","國良豐藥局","康吉藥局","祥和藥局","祥暘藥局","雪仁藥局","翔泰藥品有限公司","進安藥局","慈輝藥師藥局","新永富藥局","新庄藥局","新利賀專業藥局","新明通藥局","瑞昌藥局-旗艦店","瑞瑛藥局","睦林藥局","群益藥局","義興配藥局","萬信藥局","裕源藥局","達康藥局","福德健保處方藥局","維立藥局","廣安大藥局","德康藥局","德豐藥品股份有限公司","潭子福倫藥局","學府藥局","學府藥局","樹德大藥局","濟生一藥局","濟安堂藥局","鴻儀大藥局","豐禾藥局","豐嶸大藥局","麗新健保大藥局","一心藥局","九州藥局","又又藥局","三立藥局","三宜藥房","三源藥局","三銘大藥局","上海聯合藥房股份有限公司","丸三大藥局","千福大業高島屋","千福藥品有限公司","大直藥局","大盛藥品有限公司","大順藥品有限公司","小藥師健保藥局","川秀藥局","中山藥局","中心藥局","中英大藥房","中華西藥行","中韓西藥行","予志藥局","仁一藥局","元氣生活健保藥局","日昇西藥房","日康藥局","王中興藥局","加欣藥局","加赫藥局","古亭西藥房","幼信有限公司","正中藥局","正和藥局","正昌藥局","正康藥房有限公司","永誠藥局","田倉藥局","石川藥師藥局","立信藥局","立康大藥局","合生藥局","合泰藥品有限公司","吉星藥局","安安藥局","安佑藥局","安泰藥師藥局","江南大藥局","老永茂西藥房","西湖藥局","吳順安藥局","宏泰藥師藥局","宏越藥局","宏陽健康事業股份有限公司","快安藥局","杏佳藥局","杏城藥局","貝爾健康美容企業有限公司","亞博藥師藥局","佳和藥局","佳赫藥局","佳龍藥局","東霖醫療儀器行","芝欣藥局","長安藥局","保慶藥局","信康藥局","信義藥局","南風藥局","建民藥局","建如藥局","建利西藥房","建祥城中藥房","建祥藥局","春天連鎖藥妝-錦州店","春天藥局-德行店","春天藥品-大南店","春天藥品-北投店","春天藥品-吉利店","春天藥品-致遠店","春天藥品-酒泉店","春天藥品-華齡店","春天藥品-總公司","洪暘藥局-博登連鎖店","活力健康藥妝藥局-中華店","美日藥局","美麗田藥局","家赫藥局","展佑藥局","師大藥局","益元中西藥房","益新生技股份有限公司","健華西藥有限公司","唯康藥局","國杏藥局","專品藥局","康之友藥局","康宜庭-景文店","康宜庭-萬隆店","康宜庭-興隆店","康宜庭-總店","康祥藥局","康揚藥局","清白藥局","盛康天母店","盛康-延壽店","盛康-松德店","盛康-信義店","盛康-農安店","盛康醫藥股份有限公司","盛康藥局","盛康藥局-吉林店","盛康藥局-東湖店","盛康藥局-前港店","盛康藥局-致遠店","盛康藥局-德行店","祥全藥局","祥安藥局","祥瑞中西大藥局","傑安藥局","博信藥房","博昱大藥局","博惠藥局","博揚商行","博興藥局","富宥康生活事業有限公司","富康活力藥局","富康藥局","華君藥局","進達藥局","逸仙藥師藥局","慈航藥局","新東發藥局","新聖安西藥房","新廣生西藥房","聖英藥品有限公司","萬隆大藥局","達揚藥局","榮昌藥局","榮星藥局","榮泰藥局","綠杏大藥局","綠杏事業股份有限公司","德恩藥師藥局","德康大藥局","樂活苑藥局","樂康藥妝藥局","燕福藥局","龍護大藥局","濟仁藥局","麗中藥局","人生藥局","人安藥局","千多藥局","大力藥局-大灣店","大正藥局","大吉藥局","大家藥局","大灣藥局","山川中西藥局","仁愛藥局","心得藥局","王藥局","平安藥局","平安藥局","民生藥局","玉井藥局","田邊藥局","仲宏藥局","光明宜康藥局","安安藥局","安泰藥局","安興藥局","安麗兒藥局-歸仁店","成吉藥局","早安藥師藥局-北園店","佑康藥局-民治店","佑康藥局-新進店","志華西藥房","良方藥局","良泰藥局","佳里藥局","周藥師藥局","炎光藥行股份有限公司","芳瑜藥局","長榮藥局","長興成藥品有限公司","南安藥房有限公司","建昌藥局佳里店","建壽藥局","美兆藥業有限公司","美德生醫藥局","重仁藥局","家嘉藥局","家嘉藥局","振裕藥局","桂林堂藥房","泰赫中西藥局","健新藥局","博愛中西藥局","富傑藥局","菁安藥局","萊安藥局","雅里藥局","愛兒屋藥品有限公司","慈惠藥師保健藥局","新日康藥局","新生西藥房","新和德健保藥局","新營大安藥局","楊生藥局","源大醫藥局","詩柏爾藥妝生活館","嘉洲藥局","嘉鶴藥局","榮記藥行有限公司","慶豐綜合藥局","龍金藥局（安和店）","豐陽藥局","麗暉藥師藥局","躍達藥局","三華藥師藥局","大榮藥師藥局","中興藥局","天一藥局","文化藥師藥局","日昇藥局","宜生藥局","長生藥局","信隆藥局","南陽藥局","南興西藥房","建芳藥局","振芳藥局","健康家藥局","微風藥師藥局","新豐藥房","頭城藥局","一生西藥房","千登健保藥局","大德藥局","仁德藥房","永和藥局","立健藥局","吉康藥局","益康大藥局","健安西藥房","張藥師藥局","祥康網路藥局","富一藥局","黃藥局","慈慧健保藥局","新惠誠藥妝","德生藥局","德興藥局","早安藥局","和康藥局","建和藥局","埔里福倫藥局","家禾藥局","祝安堂藥房","國聖藥局","集成藥局","順安藥局","慈仁藥局","萬壽堂藥局","資生藥局","廣元藥局","優適藥局","獻奇藥局","三和藥局","三鐵藥妝有限公司","大何有限公司","大林藥局","大茂藥局","大眾藥師藥局","內埔藥師藥局文化店","內埔藥師藥局南寧店","正宗西藥房","立登藥局","吉村藥局","安欣藥師藥局","宏大藥師藥局","里港藥局","和成健康藥局","忠安中西藥局","昕妙春藥局","東華藥局","欣大眾藥局","長生藥局","保生藥局","信安藥局","信康藥粧藥局-復興店","南州健人藥師藥局","美加康藥局","博林藥局","富安(黑豬)藥局","進德藥局","陽生藥局","隆山藥局","黃藥師藥局","新東京藥局","新東海藥局","萬丹藥局","葉藥局","樹生藥局","穎昇藥局","寶慷藥局","上林藥局","辰安藥局","佳慶股份公司（萬泓藥局）","信和藥局","信源西藥房","泉興藥局","家嘉藥局","康利藥局","盛安藥房","發元西藥房","維康藥局","德安藥局","樂田藥妝藥局","鴻輝藥局","101藥師聯合藥局","九德藥局","千福藥品有限公司(中壢)","大一藥局","中興藥師藥局","中壢聯合藥局","五代全民藥局","天勝西藥房","弘安育藥局","弘安藥局","全球-佳美大藥局","全球-埔心大藥局","全球-桃園奇美店","全球-健民大藥局","全球連鎖大藥局-中壢永美店","全球連鎖大藥局-中壢同慶店","全球連鎖大藥局-中壢宜美店","全球連鎖大藥局-和平店","全球連鎖大藥局-龍安店","全球-龍正藥局","全球-環球店","全球藥局-維格店","全球藥局-龍潭全球店","安欣大藥局","竹康藥師藥局","均康藥局","育康-八德大湳店","育康-平鎮壢新店","育康生技有限公司","育康-桃園中正店","育康連鎖藥局-中壢中正店","育康連鎖藥局-龜山中興店","長青藥局","保和大藥局","品一藥局","恆安藥局","真善美大業店","真善美連鎖藥妝-內壢店","真善美連鎖藥妝-桃園新屋店","真善美連鎖藥妝-桃園觀音店","真善美連鎖藥妝-龍潭百年店","真善美楊梅店","唯康藥局","國民企業股份有限公司","康熙藥局","得康藥局","現代藥師藥局","莘莘藥局","凱悅藥局","賀生西藥房","新華興清溪藥局","新資生連鎖藥局 內壢店","新資生連鎖藥局 福州店","新資生連鎖藥局康莊店","新資生連鎖藥局復興店","聖昌藥局","聖鑫藥局","資生楊梅大藥局","壽安中西藥局","榮善堂中西藥行","福德藥局","閤家康聯合藥局","領耀大藥局","億源藥局","廣福藥局","德美藥局","誼康藥妝","龍大藥師藥局","龍潭西藥房","環球生活事業股份有限公司","聯合藥局","鴻安藥房","繕葆藥局","一泰大藥局","人和藥局","八仙藥局","三和藥局","上鼎藥師健保藥局","久億藥局","大中華藥局","大明成西藥房","中美藥局","中美藥師藥局","天天美藥局","世詠藥局","仕康生活藥品有限公司","仙光藥局","加和藥局","北京藥局","四季健保藥局","弘興藥局","必健藥局","正人藥師藥局","民權藥局","禾田生技醫藥股份有限公司","立米藥品有限公司","伊生藥局","伊甸藥師藥局","合豐藥局","吉辰藥局","好郝藥局","安信藥局","安泰連鎖藥局","安闔藥局","成吉藥局","成安藥局","有機藥局","宏仁藥局","育安健保藥局","和信藥師健保藥局","和德藥局","奇美藥局","宗明藥局","幸福藥師藥局","東京連鎖藥局","欣仁惠藥局","金元藥局","金高泰藥局","金發藥局","金鼎藥局","金德西藥房","長青連鎖藥局-皇慶店","青年生技公司","信成大藥局","冠華藥局","勁好健保藥局","南京藥局","南星藥局","建佑藥局","星億藥局","柏松藥局","洋洋藥局","英祥藥局","健民藥局-博登連鎖店","健配藥品股份有限公司","健智美綜合藥師藥局大仁店","御康養生有限公司","敏安藥局","眾安藥局（辰安實業社）","連仲藥局","麥田藥局","博登藥局（人禾藥局）","惠民藥局","惠光西藥局","景福藥局","翔生藥局","華安藥局","隆全藥局","隆德藥局","順成藥局","愷頓藥品股份有限公司","新友藥局","新永安藥局","新高橋藥局（天祥店）","新高橋藥局（明誠店）","新高橋藥局（陽明店）","新高橋藥局（澄清店）","新高橋藥局八德中店","新高橋藥局-土庫店","新高橋藥局仁雄店","新高橋藥局-明倫店","新高橋藥局-河堤店","新高橋藥局-青年店","新高橋藥局-美東二店","新高橋藥局-軍校店","新高橋藥局-重愛店","新高橋藥局-崇德店","新高橋藥局-華夏店","新高橋藥局-華榮店","新高橋藥局-新富店","新高橋藥局-裕明店","新高橋藥局-裕誠店","新高橋藥局-夢時代店 ","新高橋藥局-榮總店","新高橋藥局-德賢店","誠大藥局","福民藥局","福安藥妝有限公司","福德中西藥局","銘生藥局","鳳明藥局","鳳林藥局","德民藥局","德昌藥局(總部)","澄和藥局","賜安藥局","聯橋健康事業股份有限公司","護民藥房","大田大藥局","永隆藥局","何房藥局","宏仁藥局","杏光西藥房","長春藥局","婕登連鎖藥局","喬寶藥局","一生藥局","上好連鎖藥局-上海店","井上西藥房","仁安堂藥局","友杏健康健保藥局","召安大藥局","永光西藥房","全仁藥局","成恩藥局","和勇藥局","昇陽大藥局","明泰藥局-博登連鎖店","武田西藥房","南星大藥局","茂恩藥局","健康藥局","崇愛藥局","張維修藥局","惠生大藥局-延平店","瑞大藥局","義泰藥局","萬安西藥房","端發藥局","樂芯藥局","九崧藥局","三民藥局","三峽大昌藥局","上全藥局","大竹藥局","大峰藥局","大楓藥師藥局","大豊開發股份有限公司","大福藥局","小林健保藥局","中美永結藥局","中華健保藥局","元蒼藥局","友祥藥局","天士藥局","天文大藥局","天佑藥局","天利藥局","天康大藥局","天賜藥局","北大藥局","台大藥局","台化藥局","巧新婦嬰生活藥妝有限公司","弘光藥局","弘昌藥師藥局","永利藥局-友善連鎖","永康慈航藥局-汐止","玉美藥局","立新藥局","全球-欣美大藥局","合康藥師藥局","吉田藥局","吉利安健保藥師藥局","吉城大藥局","向康藥局","安佑藥局","汐芷藥局","伯聯藥局","吳廣隆藥局","均安藥局","宏安藥局","宏奇藥局","快安藥師藥局","杏運草藥局","協安大藥局","幸福藥局","招安藥局","易安堂健康有限公司","東京大藥局","松南藥局","欣安藥局","芯聯藥局","青松藥局","保康藥局","信隆大藥局","南雅藥局","厚德藥局","威安生活事業股份有限公司","威安藥局中和店","威安藥局-新店中正店","威康藥局","春天連鎖生活藥妝-淡水店","春天連鎖藥局-一心店","春天藥局-竹圍","春天藥品-中原店","春天藥品-五華店","春德堂藥局","活元藥局","皇安生技股份有限公司","美滿藥局","虹元藥局","貞心藥局","原大藥局","埔全藥局","埔墘藥局","埔銓藥局","家家藥局","家福藥局","庭安藥局","健康藥師藥局","健業藥局-板橋店","唯新婦嬰生活藥妝有限公司（唯新示範藥局）","唯新藥局","康宏安藥局","康宜庭-大坪林店","康宜庭-北新店","康宜庭-市公所店","康宜庭-民權店","康宜庭生活藥局","康宜庭-碧潭店","理方藥局","盛加藥局","盛安大藥局","祥發藥局","博登長安店(慧安藥局)","博登藥局-蘆洲長榮店","富康活力藥局總倉","惠元藥局","惠蒼西藥房","華特健康藥局","華特藥局","華興藥師藥局","萊康健保藥局","萊康連鎖藥局-中正店","詠濟藥品有限公司","進安大藥局","進發大藥局","陽光活力藥局","陽光藥局","陽光藥師藥局","順儷藥師藥局","微笑埔銓藥局-中平店","慈航藥局-南港","新進發藥店","瑞平藥局","瑞發藥局","蓁美健康藥局","銓家藥局","廣欣藥局","廣欣藥局-廣安店","廣欣藥局-廣信店","廣益藥局","廣誠藥局","德和便利藥局","德莘藥局","德隆藥局","德榮藥局","德翰藥局","緣來藥師藥局","賜安藥局","翰林藥局","臻曜藥局","臻燿藥局","戴安藥局","璨鴻藥局","穗元大藥局","聯康藥局","鴻泰藥局","禮隆藥局","闔安藥局","鶯歌宏達藥局","三立藥局","中正藥局","仁美藥局","友一藥局","台安藥妝","合康生活－中華店","合康連鎖藥局(西大店)","合康連鎖藥局(食品店)","合康連鎖藥局(湳雅店)","合康藥局中華店(合康國際藥品公司)","快樂連鎖藥局(立新店)","法瑪士藥局","芳鄰藥師藥局","金松大藥局","信芳藥局","真善美新竹中央店","真善美新竹竹中店","真善美新竹建中店","真善美新竹食品店","真善美新竹經國店","高晟健康事業有限公司(快樂大庄店)","康博中西藥局","婷婷藥局","新芳鄰藥師藥局","新康藥局","新祥發西藥房","聖心藥局","日榮堂藥房","合康連鎖藥局(竹北二店)","合康連鎖藥局(竹北店)","合康連鎖藥局(竹東店)","合康連鎖藥局(湖口店)","如家藥師藥局","快樂連鎖藥局總倉","真善美竹北勝利店","真善美湖口民族店","真善美湖口成功店","真善美湖口達生店","真善美新埔店","真善美新豐店","國豐大藥局","康立藥局","華德藥局","榮信藥局","鴻達藥局","大向藥局","大安西藥房","中興中西藥局","安泰藥局","松柏藥局","保健藥局","振安藥局","徠的安藥師藥局","新宏祥西藥房","照安健保藥局","誠泰藥師藥局","齊悅藥局","廣元藥局","興業藥局","久久藥局","大東藥局","大順藥局","弘安藥粧生活館","佑康藥局","育生西藥房","朝榮西藥房","萬有藥局","嘉新藥局","榮美藥品有限公司","德信藥局","二林福倫藥局","三立大藥局","大福藥局","天喜生大藥局","日信西藥房","日信藥品有限公司","必安藥局","正光藥局中正店","永吉藥局","永康藥局","光成藥房","合康藥局","安濟藥局","成安藥局","伸港藥局","良安藥局","和平藥局","和美福倫藥局","尚豪藥局","欣冠藥局","花壇福倫藥局","長聖樹藥局","信生西藥房","信昇藥局","恆安藥局","春生藥局愛民店","春生藥局新庄店","員林鼎澄藥局","家家藥局","泰安西藥房","真豐藥局-鹿港店","健全藥局","啟安大藥局","埤頭藥局","康好健保藥局","張藥局","勝華西藥房","善生藥局","瑞成西藥房","萬春西藥房","鼎澄秀傳一店","嘉信藥局","彰化福倫藥局","廣生堂藥局","樺霖藥業","醫聯藥師藥局"],

            p_storeArr: ["台中市中區台灣大道一段20號","台中市太平區中山路二段357號","台中市大里區中興路二段333號","台中市東勢區豐勢路85號","台中市大甲區文武路18號","台中市大甲區蔣公路202號","台中市大里區大明路539、541號","台中市梧棲區中央路一段907號","台中市大雅區雅環路二段20號","台中市南屯區向心南路962、964號","台中市南屯區大業路571號","台中市南屯區大墩南路431號","台中市東區十甲路505號","台中市北區五權路404號","台中市北屯區進化北路27號","台中市東勢區豐勢路421號","台中市大里區東榮路484號","台中市后里區福容路201號麗寶Outlet櫃號3102","台中市北屯區四平路469號","台中市南區台中路154號","台中市北屯區崇德路二段467號","台中市大肚區沙田路二段636號","台中市中區台灣大道一段95號","台中市西屯區逢甲路92號","台中市沙鹿區中山路286號","台中市梧棲區梧棲路93號","台中市烏日區中山路一段397號","台中市西區向上路一段359號","台中市西區林森路98之2號","台中市北屯區大鵬路32號","台中市西屯區玉門路50巷5之1號","台中市潭子區潭興路三段93號","台中市中區中華路二段63號","台中市太平區東平路612號","台中市中區自由路二段45號","台中市中區中山路96號","台中市北屯區軍功路二段239號","台中市北屯區崇德路二段12號","台中市南區美村南路68之2號","台中市西屯區寶慶路50巷1號","台中市西區南屯路一段32號","台中市南屯區黎明路二段199號","台中市西區台中港路一段104之10號","台中市北區永興街112之1號","台中市后里區民生路123號","台中市太平區中興路66號","台中市西屯區逢甲路151號","台中市西屯區河南路二段350號","台中市北屯區松竹路二段192號","台中市南屯區黎明路二段432號","台中市西屯區河南路二段332號","台中市東區進德路41號","台中市太平區中山路二段327號","台中市豐原區忠孝街46號","台中市后里區甲后路400號","台中市潭子區潭興路二段429號","台中市豐原區三豐路101號","台中市北屯區平德路122巷1號","台中市北屯區北平路三段34號","台中市北區五權路158號","台中市石岡區石岡街53號","台中市霧峰區中正路880號","台中市烏日區興祥街3號","台中市東勢區豐勢路21號","台中市梧棲區中和街126號","台中市北屯區太原路三段147號","台中市霧峰區中正路1162號","台中市太平區太平路509號","台中市沙鹿區中山路280號","台中市豐原區西勢路115號","台中市大里區大明路306號","台中市西區美村路一段670號","台中市大肚區遊園路二段223-1號","台中市西屯區河南路二段295號","台中市東勢區豐勢路232號","台中市北區學士路155號","台中市霧峰區中正路915號","台中市南屯區黎明路一段1155號","台中市東區東英八街106號","台中市南區忠明南路628號","台中市烏日區中山路一段5號","台中市西區南屯路一段66之7號","台中市西屯區中工三路139號","台中市大里區塗城路758號","台中市豐原區豐南街12號","台中市西屯區青海路一段101號","台中市西屯區中工三路156號","台中市大里區益民路二段304號","台中市潭子區中山路一段19之8號","台中市南區學府路180號","台中市大雅區學府路225號","台中市太平區樹德路102號","台中市沙鹿區沙田路146號","台中市南屯區南屯路二段788號","台中市南區大慶街二段3之4號","台中市北屯區同榮路163號","台中市豐原區中正路196號","台中市西區向上路一段162號","台北市大安區和平東路三段238號","台北市信義區和平東路三段239號","台北市松山區民生東路五段238號","台北市信義區忠孝東路五段492巷34號","台北市內湖區內湖路一段737巷31號","台北市萬華區康定路197號","台北市大同區迪化街一段80號","台北市中正區衡陽路32號","台北市北投區自強街105號","台北市士林區忠誠路二段55號B1","台北市大安區羅斯福路三段245號10樓之1","台北市中山區北安路617號","台北市中正區中華路一段21巷16號","台北市萬華區萬大路486巷26號","台北市南港區福德街320之1號","台北市北投區石牌路二段99巷9號","台北市中山區林森北路128號","台北市中正區汀州路三段121號","台北市中正區永綏街6號","台北市中正區衡陽路4號","台北市萬華區西寧南路205號","台北市松山區富錦街521號","台北市中山區林森北路520號","台北市大安區新生南路一段161巷10號","台北市萬華區廣州街124號","台北市士林區士東路12號","台北市中山區龍江路273號","台北市南港區南港路二段26號","台北市士林區文昌路76號","台北市中正區汀州路三段117號","台北市內湖區麗山街364巷2號","台北市大同區民族西路213號","台北市信義區吳興街225巷6號","台北市大安區通化街38巷9號","台北市中正區漢口街一段22號","台北市大安區忠孝東路四段216巷25之1號","台北市士林區士東路124號","台北市士林區忠義街70號","台北市信義區松山路403號","台北市松山區八德路四段2之1號","台北市松山區南京東路五段123巷45號","台北市中正區衡陽路26號","台北市中正區襄陽路19號","台北市內湖區康寧路一段42號","台北市信義區吳興街247號","台北市士林區延平北路六段83號","台北市內湖區文德路22巷9弄56號","台北市萬華區廣州街64號","台北市內湖區內湖路一段355號","台北市大安區濟南路三段22之1號","台北市大同區酒泉街131號","台北市萬華區中華路二段392號","台北市大同區承德路一段17號7樓","台北市大同區南京西路282號","台北市內湖區康寧路一段51號","台北市士林區天母東路24號","台北市士林區中山北路七段82巷9號","台北市南港區興華路81號","台北市中正區公園路30號","台北市士林區文昌路44號","台北市南港區研究院路二段80號","台北市中正區汀州路三段113號","台北市松山區八德路三段148號","台北市中山區長安東路二段171之3號","台北市大同區保安街21號","台北市中正區南昌路一段143號","台北市萬華區青年路28號","台北市士林區美崙街19號","台北市北投區光明路161號","台北市大安區和平東路三段228巷11號","台北市大同區重慶北路一段85之3號","台北市中正區武昌街一段29號2樓","台北市大同區寧夏路17號","台北市中山區錦州街213號","台北市士林區德行東路76號","台北市士林區大南路317、319號","台北市北投區中央南路一段76號","台北市北投區吉利街120號","台北市北投區致遠一路一段132號","台北市大同區酒泉街94號","台北市士林區華齡街38號","台北市士林區通河東街一段167巷35號5樓","台北市信義區富陽街86號","台北市中正區中華路二段315巷1號","台北市中山區天津街64號","台北市士林區通河街78號","台北市士林區忠義街80號","台北市中山區長春路146之1號","台北市大安區師大路99號","台北市北投區光明路106號","台北市大安區復興南路一段368-1號3樓","台北市萬華區康定路328號","台北市松山區八德路三段211號","台北市中正區延平南路171巷3號 ","台北市萬華區長沙街二段71之1號","台北市萬華區青年路20號","台北市文山區景文街97號","台北市文山區羅斯福路五段202號","台北市文山區興隆路三段200號","台北市文山區興隆路四段64之1號","台北市大安區忠孝東路四段216巷21號","台北市北投區中和街322號","台北市內湖區東湖路108號","台北市士林區天母東路8巷84號","台北市松山區延壽街111號","台北市信義區松德路40號","台北市信義區信義路六段69號","台北市中山區農安街267號","台北市中山區建國北路二段129號7樓","台北市大同區延平北路二段164號","台北市中山區吉林路397號","台北市內湖區康寧路三段99巷10弄1號","台北市士林區前港街28號","台北市北投區致遠二路141號","台北市士林區德行東路206之1號","台北市中正區信義路二段79巷15之8號","台北市南港區中坡南路25號","台北市大安區復興南路一段107巷49號","台北市松山區八德路二段437巷7弄8號","台北市士林區延平北路六段61號","台北市大安區樂業街150號","台北市士林區華榮街16號","台北市文山區景興路181號","台北市大安區四維路198巷28號","台北市中山區北安路608巷5弄22號","台北市南港區研究院路一段101巷8號","台北市大同區延平北路二段126號","台北市文山區興隆路二段60號","台北市中正區中華路二段453號","台北市文山區興隆路二段218之1號","台北市士林區文林路441號","台北市南港區成福路198號","台北市大同區昌吉街130號","台北市大安區仁愛路四段32號","台北市大安區信義路四段265巷26號","台北市文山區羅斯福路五段218巷15號","台北市士林區社正路36號","台北市中山區雙城街17之3號","台北市松山區南京東路四段133巷5弄1號","台北市信義區光復南路419巷19號","台北市信義區吳興街241號","台北市文山區興隆路三段111號","台北市松山區八德路二段378號","台北市信義區松山路541巷21號","台北市中山區北安路546號","台北市內湖區文德路117號","台北市大安區羅斯福路三段283巷14弄14號之3","台北市大安區大安路一段224巷7號","台北市中正區濟南路二段22號","台北市信義區福德街217號","台南市新營區中山路249號","台南市新營區信義街70號","台南市北區金華路五段1號","台南市永康區大灣路376號","台南市北區公園南路357號","台南市南區新興路437號","台南市東區大同路二段175號","台南市永康區民族路298號","台南市仁德區中正路二段325號","台南市善化區中山路178號","台南市學甲區建國路82號","台南市東區小東路190之1號","台南市中西區永華路一段236號","台南市麻豆區興中路11號","台南市鹽水區三福路51號","台南市玉井區中華路47號","台南市中西區中正路236號","台南市安南區安中路三段431號","台南市東區光明街36之2號","台南市麻豆區興中路88號","台南市白河區中正路93號","台南市佳里區中山路345號","台南市歸仁區中山路二段71號","台南市仁德區中正路二段468號","台南市北區北園街6之6號","台南市新營區民治路3之5號","台南市新營區新進路二段103號","台南市永康區中正路984號","台南市永康區中山路39號","台南市東區仁和路117之1號","台南市佳里區中山路359號","台南市東區崇善路654號","台南市中西區西門路二段176號","台南市白河區康樂路72號","台南市西港區新興街12巷14號","台南市佳里區興化里佳里興440之2號 ","台南市中西區中正路50號","台南市佳里區光復路371號","台南市安南區海佃路二段572號","台南市新營區民治路169之1號","台南市永康區復國一路496號","台南市新市區中興街48號","台南市永康區復國一路206號","台南市永康區復國一路206號","台南市仁德區二行一路165號","台南市下營區中山路一段2號","台南市安南區安中路四段79號","台南市關廟區中正路947號","台南市玉井區中正路238號","台南市新化區中正路545號","台南市東區中華東路二段49號","台南市佳里區中山路222號","台南市中西區民族路三段285號","台南市永康區中正路110號","台南市永康區國光七街71號","台南市新營區民權路63之3號","台南市中西區西門路二段287號","台南市新市區中正路319之1號","台南市新營區中山路255、257號","台南市下營區中山路一段90號","台南市白河區中正路55號","台南市南區金華路二段409號","台南市北區文賢路240號","台南市仁德區二空路98號","台南市東區育樂街156之3號","台南市新市區民生路57號","台南市安南區安和路五段98號","台南市南區文南路115號","台南市新營區民權路51號","台南市歸仁區大智街10號 ","宜蘭縣礁溪鄉中山路二段202號","宜蘭縣宜蘭市校舍路23號","宜蘭縣宜蘭市中山路三段209號","宜蘭縣羅東鎮南昌街99號","宜蘭縣宜蘭市復興路一段131號","宜蘭縣五結鄉中正路二段59號","宜蘭縣宜蘭市新民路111號","宜蘭縣羅東鎮復興路一段1號","宜蘭縣羅東鎮南門路5號","宜蘭縣蘇澳鎮中山路一段120號","宜蘭縣宜蘭市光復路130號","宜蘭縣羅東鎮民權路31號","宜蘭縣宜蘭市中山路三段179號","宜蘭縣宜蘭市東港路48之2號","宜蘭縣宜蘭市神農路二段46號","宜蘭縣蘇澳鎮江夏路26號","宜蘭縣頭城鎮開蘭路134號","花蓮縣玉里鎮光復路158號","花蓮縣花蓮市中央路三段653號","花蓮縣花蓮市中山路152號","花蓮縣玉里鎮中華路140號","花蓮縣吉安鄉建國一段145號","花蓮縣瑞穗鄉中華路12號","花蓮縣花蓮市中正路360號","花蓮縣花蓮市富國路146號","花蓮縣花蓮市中山路537號","花蓮縣花蓮市中山路106號","花蓮縣花蓮市中美路87之2號","花蓮縣吉安鄉中華路二段201號","花蓮縣新城鄉北埔路203號","花蓮縣吉安鄉建國路二段165號","花蓮縣花蓮市中華路34號","花蓮縣花蓮市中山路329號","花蓮縣玉里鎮中山路二段58號","南投縣竹山鎮雲林路41號","南投縣南投市復興路75之1號","南投縣草屯鎮中山街412號","南投縣埔里鎮中山路二段367號","南投縣集集鎮民生路237號","南投縣埔里鎮南盛街149號","南投縣草屯鎮芬草路一段35號","南投縣埔里鎮南興街270號","南投縣草屯鎮中正路768號","南投縣竹山鎮集山路三段942號","南投縣草屯鎮中山街211號","南投縣埔里鎮中山路二段418號","南投縣南投市民族路227號","南投縣竹山鎮大明路149之5號","南投縣名間鄉南雅街102號","屏東縣屏東市中華路8號","屏東縣屏東市廣東路623號","屏東縣屏東市中正路167之1號","屏東縣屏東市平和里仁愛路59號","屏東縣屏東市逢甲路85號","屏東縣東港鎮新生三路138號","屏東縣內埔鄉文化路382號","屏東縣內埔鄉南寧路2號","屏東縣潮州鎮新生路36之1號","屏東縣麟洛鄉中山路256之1號","屏東縣枋寮鄉中山路85號","屏東縣潮州鎮延平路168號","屏東縣鹽埔鄉彭厝路38之5號","屏東縣里港鄉永春路65號","屏東縣林邊鄉中林路123號","屏東縣長治鄉中山路10號","屏東縣萬巒鄉新隆路48號","屏東縣東港鎮中正路83號","屏東縣東港鎮中正路一段92號","屏東縣內埔鄉仁和路7號","屏東縣東港鎮中山路56號","屏東縣屏東市漢口街11號","屏東縣屏東市復興一路321號","屏東縣南州鄉三民路149號","屏東縣屏東市廣東南路65號","屏東縣萬丹鄉大昌路458號","屏東縣里港鄉永春路8號","屏東縣萬丹鄉萬丹路一段158號","屏東縣屏東市逢甲路26號","屏東縣枋寮鄉中山路115之2號","屏東縣萬丹鄉社皮路三段428、430號","屏東縣屏東市棒球路47號","屏東縣屏東市民生路116號","屏東縣萬丹鄉和平西路5號","屏東縣高樹鄉南興路49-8號","屏東縣屏東市民族路70號","屏東縣九如鄉九如路二段131號","屏東縣屏東市中正路398號","苗栗縣苗栗市府前路91號","苗栗縣頭份鎮尖豐路32號","苗栗縣頭份鎮東興路66號","苗栗縣苑裡鎮天下路80之67號","苗栗縣頭份鎮信東路39號","苗栗縣頭份鎮民族路28號","苗栗縣銅鑼鄉中正路128號","苗栗縣頭份鎮仁愛路86號","苗栗縣苗栗市中正路748號","苗栗縣苗栗市中正路908號","苗栗縣通霄鎮信義路104號","苗栗縣竹南鎮光復路40號  ","苗栗縣頭份鎮信東路135號","苗栗縣後龍鎮中華路64之1號","桃園市龍潭區中正路44號","桃園市蘆竹區中山路69號","桃園市中壢區元化路357號B1(中壢SOGO B1)","桃園市桃園區中山路684之1號","桃園市龍潭區中興路399號","桃園市中壢區大同路131號","桃園市桃園區中山路97號","桃園市桃園區安樂街53號","桃園市龍潭區北龍路144號","桃園市楊梅區新農街15號","桃園市八德區介壽路一段688號","桃園市楊梅區永美路395號","桃園市桃園區中正五街185號","桃園市八德區介壽路二段282號","桃園市中壢區中山東路二段530號","桃園市中壢區健行路52號","桃園市中壢區莊敬路716號","桃園市平鎮區和平路160號","桃園市桃園區龍安街111號","桃園市龍潭區中正路231號","桃園市八德區介壽路一段831號","桃園市桃園區大興西路二段129號","桃園市龍潭區北龍路185號","桃園市大溪區介壽路758號","桃園市蘆竹區大竹路525號","桃園市桃園區國鼎一街27號之4","桃園市八德區廣福路24號","桃園市平鎮區廣泰路126號","桃園市平鎮區中豐路170號","桃園市桃園區中正路576號","桃園市中壢區中正路366號","桃園市龜山區中興路一段22號","桃園市龜山區復興一路82號","桃園市大園區中山北路36號","桃園市桃園區建新街76號","桃園市蘆竹區忠孝西路36號","桃園市桃園區大業路一段128號","桃園市中壢區成章二街530號","桃園市新屋區中華路251號","桃園市觀音區四維路2號","桃園市龍潭區中豐路309號","桃園市楊梅區光華街14號","桃園市平鎮區中豐路南勢二段144號","桃園市桃園區中正路578號2樓","桃園市龍潭區中正路128號","桃園市中壢區龍岡路二段89號","桃園市平鎮區育達路96號","桃園市桃園區莊敬路一段368號","桃園市龜山區復興一路126號","桃園市中壢區華勛街165號","桃園市桃園區中山東路10號","桃園市中壢區成章一街162號 ","桃園市中壢區福州二街409號","桃園市大溪區康莊路130號","桃園市大溪區復興路92之1、96號","桃園市桃園區中正路1238號","桃園市楊梅區永美路389號","桃園市楊梅區楊新路100號","桃園市桃園區介壽路402號","桃園市中壢區前龍街9號","桃園市中壢區福德路30號","桃園市平鎮區中豐路山頂段256號","桃園市中壢區元化路97號","桃園市中壢區林森路176號","桃園市觀音區新生路41號","桃園市蘆竹區中山路159號","桃園市蘆竹區奉化路126號","桃園市龍潭區中正路169號","桃園市龍潭區龍華路27號","桃園市八德區介壽路二段282號","桃園市中壢區中山路229號","桃園市八德區介壽路二段368號","桃園市龍潭區中興路309號","高雄市鳳山區五甲一路5號","高雄市苓雅區正義路180之6號","高雄市前鎮區瑞隆路253號","高雄市苓雅區廣州二街117號","高雄市大社區中山路423號","高雄巿前鎮區保泰路351號","高雄市鳳山區光遠路424號","高雄市梓官區光明路14號","高雄市苓雅區武廟路98號","高雄市大寮區鳳屏一路418號","高雄市旗山區中山路92號","高雄市楠梓區楠都東街138號","高雄市三民區建興路222號","高雄市前鎮區瑞隆路393號","高雄市苓雅區和平一路143之7號","高雄市鳳山區五甲二路342號","高雄市仁武區永仁街321號","高雄市鼓山區鼓山三路48之11號","高雄市左營區自由二路90號","高雄市楠梓區軍校路672號","高雄市橋頭區成功路229號","高雄市小港區孔鳳路561號3、4、5樓","高雄市大社區中山路201號","高雄市梓官區梓官路22之1號","高雄市鳳山區新強路83號","高雄市苓雅區自強三路95號","高雄市左營區左營大路41之1號","高雄市鳳山區經武路178號","高雄市三民區鼎山街665號","高雄市大寮區鳳林三路835號","高雄市左營區榮總路23號","高雄市楠梓區楠梓東街74號","高雄市楠梓區後昌路1079號","高雄市左營區榮耀街3號","高雄市左營區左營大路390號","高雄市左營區富國路339號","高雄市左營區崇德路267號","高雄市阿蓮區中山路88號","高雄市仁武區中華路40號","高雄市路竹區中正路116號","高雄市苓雅區青年一路167之3號","高雄市仁武區大灣村大景二街99號","高雄市三民區大昌二路248號","高雄市左營區重愛路220號","高雄市林園區東林西路210號","高雄市大寮區鳳林四路268號","高雄市三民區鼎力路376號","高雄市岡山區平和路142號","高雄市楠梓區和光街191號","高雄市前鎮區天后街29號6樓之2","高雄市新興區七賢二路145號","高雄市三民區鼎中路530號","高雄市左營區果峰街12巷26號","高雄市鹽埕區建國四路387號","高雄市新興區中山一路173號","高雄市楠梓區右昌街191號","高雄市仁武區中正路167、169號","高雄市苓雅區輔仁路175號","高雄市大寮區鳳屏一路512號","高雄市苓雅區英祥街19號","高雄市美濃區中正路一段31之1號","高雄市苓雅區福德二路20號","高雄市鹽埕區大仁路102號","高雄市苓雅區光華一路35號","高雄市林園區林園北路118號","高雄市旗山區延平一路545號","高雄市楠梓區右昌街226號","高雄市左營區左營大路68號","高雄市三民區九如二路324號","高雄市鼓山區九如四路1426號","高雄市岡山區維仁路147號","高雄市苓雅區和平一路147之5號","高雄市左營區左營大路514號","高雄市湖內區中山路一段451之19號","高雄市岡山區仁壽路38之1號","高雄市前鎮區前鎮街170號","高雄市梓官區城隍巷31號","高雄市岡山區中山北路39號","高雄市楠梓區萬昌街111號","高雄市鼓山區九如四路1460巷4號","高雄市三民區天祥一路117號","高雄市三民區明誠一路492號","高雄市三民區陽明路192號","高雄市三民區澄清路639號","高雄市仁武區八德中路88號","高雄市楠梓區土庫路68號","高雄市仁武區仁雄路89-3號","高雄市鼓山區明倫路150號","高雄市左營區裕誠路144號","高雄市鳳山區青年路二段289號","高雄市鼓山區美術東二路77號","高雄市楠梓區軍校路882號","高雄市左營區文自路930號","高雄市左營區華夏路622號","高雄市左營區華夏路1110號","高雄市鼓山區華榮路295號","高雄市鳳山區新富路428號","高雄市左營區裕誠路1680號","高雄市左營區裕誠路370號","高雄市前鎮區中華五路789號B2","高雄市左營區民族一路1028之1號","高雄市楠梓區德賢路191號","高雄市鳳山區青年路一段305號","高雄市大寮區鳳林三路408之1號","高雄市林園區東林西路49號","高雄市鳳山區鳳北路36之1號","高雄市新興區自立一路55號","高雄市小港區二苓路247號","高雄市鳳山區鳳林路166號","高雄市楠梓區德民路911號","高雄市岡山區前鋒路183-2號","高雄市三民區澄和路66號","高雄市旗山區中山路11號","高雄市大社區中山路343號","高雄市鳳山區光遠路205號","基隆市仁愛區仁二路5號","基隆市仁愛區仁三路25之1號","基隆市仁愛區忠三路81號","基隆市安欒區安樂路二段130號","基隆市中正區和一路118號","基隆市安欒區基金一路174之16號","基隆市仁愛區愛三路53號","基隆市中正區義二路66號","雲林縣西螺鎮延平路234號","雲林縣斗六市上海路236號","雲林縣斗六市太平路97號","雲林縣斗南鎮文元街43號","雲林縣土庫鎮民權路14號","雲林縣褒忠鄉中正路456之1號","雲林縣斗六市中山路9號","雲林縣水林鄉水林路130號","雲林縣二崙鄉文化路236號","雲林縣麥寮鄉仁德路118號","雲林縣林內鄉中正路246號","雲林縣莿桐鄉中山路106號","雲林縣斗六市中華路161號","雲林縣斗六市中山路308號","雲林縣大埤鄉中正路52之2號","雲林縣土庫鎮中正路11號","雲林縣崙背鄉信義路88號","雲林縣虎尾鎮林森路一段366號","雲林縣斗南鎮延平路二段264號","雲林縣西螺鎮平和路77-2號","雲林縣土庫鎮中正路202號","雲林縣東勢鄉民生路67號","雲林縣虎尾鎮林森路一段329號","雲林縣北港鎮文化路166號","新北市中和區南華路20號","新北市新店區三民路78之1號","新北市三峽區民生街56號","新北市淡水區民族路36號","新北市中和區和平路244號","新北市板橋區莒光路168號","新北市板橋區懷仁街84號","新北市板橋區南門街81號","新北市板橋區三民路一段31巷15號","新北市三重區文化北路61之1號","新北市蘆洲區長安街185號","新北市三重區中華路95號","新北市土城區學府路一段69號","新北市板橋區裕民街107號","新北市蘆洲區中正路36號","新北市淡水區新春街136號","新北市三重區大同北路8號","新北市新莊區思源路419巷7號","新北市淡水區學府路49號","新北市三重區正義北路141號","新北市三峽區大義路9號","新北市永和區保平路240號","新北市永和區勵行街119號","新北市新店區北宜路一段84號","新北市永和區竹林路66巷19號","新北市樹林區保安街一段65號","新北市永和區永利路9、11號","新北市汐止區中興路169號","新北市三重區力行路二段136巷49弄2號","新北市土城區光明街5號","新北市三峽區大同路52號","新北市新莊區中平路306號","新北市新莊區西盛街313號","新北市淡水區中山北路一段100號","新北市土城區學府路一段205號","新北市板橋區實踐路147號","新北市板橋區館前西路152-2號","新北市汐止區福德一路255號","新北市淡水區清水街9之10號","新北市三重區長壽西街5之1號","新北市新店區民權路89號","新北市五股區成泰路二段136號","新北市土城區延吉街126號","新北市鶯歌區中正一路96號","新北市新店區北新路一段19號","新北市樹林區鎮前街126號","新北市板橋區四維路106號","新北市新莊區西盛街338號","新北市永和區智光街121號4樓","新北市新莊區民安路176號","新北市雙溪區中華路29號","新北市中和區立德街72巷20號","新北市蘆洲區民族路210號","新北市三重區中正北路336號","新北市樹林區保安街一段364號","新北市中和區安樂路6號","新北市板橋區南雅南路一段5巷22號","新北市三重區大智街175號","新北市中和區景新街338號B1","新北市永和區中和路429號","新北市新店區中正路263號","新北市永和區中正路153號","新北市淡水區中山北路一段49號","新北市新莊區中和街13號","新北市淡水區民權路89號","新北市蘆洲區中原路46、48-1號","新北市三重區五華街73號","新北市汐止區新台五路一段220號","新北市新店區民族路49號","新北市中和區中山路三段136巷10弄8號","新北市三重區中華路16號","新北市五股區自強路56號","新北市中和區永貞路280之1號","新北市永和區永和路一段20號","新北市板橋區忠孝路33號","新北市板橋區中山路二段227號","新北市土城區裕民路164號","新北市中和區民德路43號","新北市三重區仁愛街682號","新北市新莊區西盛街172號","新北市泰山區明志路二段323號","新北市板橋區文化路二段47號","新北市鶯歌區建國路161號","新北市鶯歌區尖山路219-1號","新北市永和區保福路二段78號","新北市新店區北新路三段127號 ","新北市新店區北新路二段43號","新北市新店區北新路一段285號 ","新北市新店區民權路48之2號","新北市新店區中正路542之5號3樓","新北市新店區北宜路一段41號","新北市蘆洲區長安街67號","新北市三峽區民生街49號","新北市土城區中央路一段258號","新北市土城區青雲路255號","新北市蘆洲區長安街214號","新北市蘆洲區長榮路51號","新北市汐止區新台五路一段102號19樓","新北市淡水區中正路96號","新北市土城區中央路二段216號","新北市永和區永貞路362號","新北市泰山區明志路一段260號","新北市蘆洲區中山一路184號","新北市三重區溪尾街176號","新北市蘆洲區中正路126號","新北市板橋區幸福路23號","新北市三峽區民生街174號","新北市板橋區民治街101號","新北市土城區延和路103號","新北市新莊區福壽街72號","新北市三重區三和路二段182號","新北市土城區延和路16之3號","新北市新莊區中平路77號","新北市汐止區研究院路一段101巷12號","新北市板橋區大同街24號","新北市八里區中山路二段391號","新北市中和區民享街56之1號","新北市蘆洲區九芎街90巷21號","新北市中和區員山路319號","新北市板橋區雙十路三段52號","新北市板橋區四維路355號","新北市板橋區四維路304號","新北市板橋區自由路21號","新北市汐止區建成路22號","新北市永和區得和路192號","新北市新店區中正路413號","新北市土城區裕民路153號","新北市三重區中華路91號","新北市新莊區四維路171巷1、3號","新北市永和區福和路250、252號","新北市板橋區信義路60號","新北市板橋區中正路240號","新北市三重區重新路一段129號","新北市三重區集美街150號","新北市板橋區溪北路54號","新北市土城區延和路191號","新北市三重區力行路一段151號","新北市板橋區南雅南路二段144巷4號","新北市三重區重新路一段95號","新北市三重區自強路四段64號","新北市五股區成泰路三段579號","新北市鶯歌區國慶街138號","新竹市東區新源街100號","新竹市北區中正路309號","新竹市東區振興路52號","新竹市北區西大路503號","新竹市北區西大路519號","新竹市東區中華路二段218號","新竹市北區西大路638號","新竹市東區食品路140號","新竹市北區湳雅街77號","新竹市東區中華路二段218號","新竹市北區延平北路一段245號","新竹巿東區鐵道路二段8號","新竹市北區水田街157號","新竹市東區光復路二段310號","新竹市東區科學園路133號","新竹市東區中央路181號","新竹市東區光復路一段75號","新竹市東區建中路35號","新竹市東區食品路117號","新竹市北區經國路二段268號","新竹市香山區大庄路59號","新竹市東區明湖路446之4號","新竹市東區明湖路965號","新竹市東區南大路402號","新竹市東區林森路188號","新竹市香山區中華路五段42號","新竹市東區食品路269號","新竹縣竹東鎮長春路一段281號","新竹縣竹北市福興東路一段373號","新竹縣竹北市博愛街335號","新竹縣竹東鎮長春路三段133號","新竹縣湖口鄉民族街126號","新竹縣湖口鄉光復東路335號","新竹縣竹東鎮朝陽路75號3樓","新竹縣竹北市勝利五路176號","新竹縣湖口鄉民族街98號","新竹縣湖口鄉成功路136號","新竹縣湖口鄉達生路121號","新竹縣新埔鎮中正路221號","新竹縣新豐鄉建興路一段7號","新竹縣竹東鎮長春路三段6號","新竹縣竹北市中正東路288號","新竹縣竹東鎮東林路80號","新竹縣竹東鎮長春路三段43號","新竹縣竹東鎮中興路三段174號","嘉義市西區新民路636號","嘉義市東區中山路193號","嘉義市西區垂楊路501號","嘉義市東區民族路181號","嘉義市東區民權路87號","嘉義市東區保建街161號","嘉義市東區林森東路300號","嘉義市西區世賢路一段549號","嘉義市西區民生南路574號","嘉義市西區博愛路二段361號","嘉義市東區興業東路56號","嘉義市西區玉山路145號","嘉義市西區中正路697號","嘉義市西區興業西路381號","嘉義縣朴子市中興路65號","嘉義縣大林鎮中正路338號","嘉義縣民雄鄉福樂村埤角139號","嘉義縣水上鄉寬士村崎仔頭1之300號","嘉義縣竹崎鄉灣橋村五間厝3-2號","嘉義縣溪口鄉中正路193號","嘉義縣朴子市中正路190號","嘉義縣大林鎮民權路36號","嘉義縣新港鄉公園路68號","嘉義縣朴子市海通路11之2號","嘉義縣竹崎鄉中山路184號","彰化縣二水鄉斗苑路四段669號","彰化縣彰化市中華西路111號","彰化縣花壇鄉中正路91號","彰化縣永靖鄉西門路41號","彰化縣員林市中山路一段627號","彰化縣員林市中正路259號","彰化縣員林市育英路174號","彰化縣彰化市中正路一段253號","彰化縣鹿港鎮大明路48號","彰化縣埔心鄉員鹿路二段329號","彰化縣員林市中正路306號","彰化縣北斗鎮中山路二段32、34號","彰化縣二水鄉員集路三段640號","彰化縣鹿港鎮中山路380號","彰化縣伸港鄉信義路135號","彰化縣鹿港鎮鹿和路四段15號","彰化縣和美鎮美寮路二段716號","彰化縣和美鎮彰美路六段133號","彰化縣彰化市大埔路695號","彰化縣秀水鄉中山路345號","彰化縣花壇鄉中山路二段159號","彰化縣彰化市華山路173號","彰化縣彰化市民生路103號","彰化縣員林市大同路二段182之1號","彰化縣花壇鄉花壇街249號","彰化縣和美鎮愛民路106號","彰化縣和美鎮彰新路二段535號","彰化縣員林市三民東街252號","彰化縣員林市惠來街87號","彰化縣芬園鄉彰南路四段108巷12號","彰化縣鹿港鎮民權路115之1號","彰化縣秀水鄉中山路282之1號","彰化縣芬園鄉芬草路二段230號","彰化縣埤頭鄉斗苑西路261號","彰化縣彰化市旭光路291號","彰化縣社頭鄉清水岩路367號","彰化縣埤頭鄉彰水路三段534巷28號","彰化縣花壇鄉中正路200號","彰化縣福興鄉員鹿路一段557號","彰化縣和美鎮中正路80號","彰化縣彰化市中山路一段556巷10號","彰化縣二林鎮中山路140號","彰化縣彰化市中正路二段224號","彰化縣員林市中山路一段743、745號","彰化縣溪湖鎮彰水路三段376號","彰化縣員林市員東路二段189號"],
            p_storePhone: ["04-22234996","04-23935050","04-24852072","04-25887639","04-26804212","04-26765518","04-24068864","04-26561755","04-25653456","04-24710219","04-22516715","04-24710655","04-22131348","04-22068113","04-22340208","04-25872245","04-24817636","04-25583390","04-24223378","04-22874588","04-22464485","04-26992116","04-22207700","04-27087952","04-26625339","04-26563249","04-23356118","04-24756688","04-22980342","04-22924966 ","04-24638302","04-25358076","04-22016306","04-22783697","04-22222160","04-22222154","04-24391646","04-22364635","04-22653346","04-24518597","04-23714995","04-23849128","04-22079309","04-22358880","04-25570225","04-22787987","04-27085922","04-27022702 ","04-22493138","04-22510951","04-27068798 ","04-22114206","04-23920685","04-25226700","04-556-1017","04-25367109","04-25228490","04-22924710","04-22350168","04-22225688","04-25722833","04-23328875","04-23360401","04-25885778","04-26584836","04-22369603","04-23391346","04-22755053","04-26633758","04-25262681","04-24876247 ","04-23766127","04-26910209","04-24525052","04-25873969","04-22076279","04-23301002","04-23818218","04-22129298","04-23751551","04-23372133","04-23763133","04-23586332","04-24935888 ","04-25337605","04-23118560","04-23583373","04-24815932","04-25350918","04-22187028","04-25609333","04-23981782","04-26626826","04-23899603","04-22611769","04-24260588 ","04-25256333","04-23017100","02-27321818","02-87323331","02-27422743","02-27271401","02-27998042","02-23022111","02-25583392","02-23117744","02-28230637","02-27618155","02-27403767","02-25320522","02-23316807","02-23037855","02-27867002","02-28279996","02-25236979","02-23689889","02-23615654","02-23818242","02-23710577","02-7623522","02-25711742","02-27060580","02-23062975","02-28358558","02-25034281","02-27836222","02-28336362","02-23683618","02-27996446","02-25976937","02-23455186","02-27540070","02-23311595","02-27520273","02-88662188","02-28385850","02-27687754","02-27471749","02-27602932","02-23899977","02-23117779","02-87912187","02-27222236","02-28166977","02-26595430","02-23064417","02-26279291","02-27515678","02-25957025","02-23050880","02-25557985","02-25561925","02-27915726","02-28725144","02-28716511","02-27838090","02-23117102","02-28367202","02-27885951","02-23689200","02-25706677","02-27772740","02-25538988","02-23961979","02-23074599","02-28320375","02-28912339","02-27331456","02-25556484","02-23815229","02-25568039","02-25213586","02-28380306","02-28882169","02-28916668","02-28253256 ","02-28253258","02-25977932","02-28882156","02-28882158","02-27337099","02-23390625","02-25631662","02-28855990","02-28346453","02-25232803","02-23623479","02-28912675","02-27050799","02-23063083","02-25775000","02-23811322","02-23718892","02-23011598","02-29302801","02-29348662","02-22304866","02-29385363","02-27817891","02-28946520","02-26305743","02-28720208","02-27618155","02-87891622","02-23460521","02-25038205","02-25182229","02-25575995","02-25969580","02-26305157","02-28831079","02-28263580","02-28348756","02-23939339","02-26547322","02-27752551","02-27524155","02-28128195","02-23770089","02-28320379","02-89321707","02-23256668","02-25324769","02-27828810","02-2672-0787","02-29319510","02-23039829","02-29312597","02-28815988","02-27838090","02-25978628","02-27071221","02-27076502","02-29334580","02-88115559","02-25964593","02-27124696","02-77296777","02-27582378","02-27370338","02-27782829","02-27272502","02-25323296","02-26562110","02-23627307","02-23250686","02-23514576","02-27594416","06-6322458","06-6376863","06-2295533","06-2398273","06-2226899","06-2651423","06-2153777","06-2728774","06-2794623","06-5838245","06-7835087","06-2378697","06-2292789","06-5721225","06-6521071","06-5742271","06-2200106","06-2567798","06-2376448","06-5727475","06-6856700","06-7229550","06-2399212","06-2798003","06-3351295","06-6358209","06-6354620","06-2533478","06-2325057","06-2676256","06-7212723","06-2678421","06-2222750","06-6857379","06-7952617","06-7262936","06-2223129","06-7221369","06-2555388","06-6571188","06-2030463","07-5824083","06-3121328","06-3121328","07-6995796","06-6892088","06-2562317","06-5952093","06-5743036","06-5907185","06-3361683","06-7223780","06-2200881","06-2033946","06-2718968","06-6332833","06-2226046","06-5997603","06-6322366","06-6891723","06-6831128","06-2653088","06-2583180","06-2680608","06-2360088","06-5014888","06-3561305","06-2610628","06-6333479","06-2301360","03-9882857","03-9387928","03-9369769","03-9541160","03-9332415","03-9656584","03-9327893","03-9553222","03-9544697","03-9965076","03-9322678","03-9543649","03-9322369","03-9371516","03-9362880","03-9962869","03-9770618","03-8882530","03-8571950","03-8323026","03-8882333","03-8573247","03-8870184","03-8331208","03-8311982","03-8323031","03-8329859","03-8230595","03-8531432","03-8267211","03-8578969","03-8322606","03-8322676","03-8889408","049 2651032","049-2227009","049-2353793 ","049-2999218","049-2760565","049-2989530","049-2305685","049-2992837","049-2333228","049 2632984","049-2333570","049-2982042","049-2222601","049 2630355","049-2732678","08-7322519","08-7352108","08-7328052","08-7320680","08-7323293","08-8354752","08-7693929","08-7788919","08-7883401","08-7213590","08-8781593","08-7805759","08-7935513","08-7752051","08-8752028","08-7621326","08-7850153","08-8322616","08-8351177","08-7792121","08-8322818","08-7322332","08-7550277","08-8646868","08-7512530","08-7072876","08-7756104","08-7772046","08-7322413","08-8785700","08-7075529","08-7515817","08-7224861","08-7762889","08-7967883","08-7323106","08-7393672","08-7350558","037-320685","036-633632","037-681880","037-862003","037-663580","037-664367","037-986388","037-666101","037-320145","037-320285","037-750000","037-479933","037-598995","037-721952","03-4804825","03-3116868","03-4259643","03-2171836","03-4091005","03-4250641","03-3355001","03-3323846","03-4808824","03-4757775","03-3662930 ","03-4852081","03-3474765","03-4783161","03-4661839","03-4688239","03-4637687","03-4683247","03-36096339","03-489-9639","03-3756939","03-3016639","03-4423026","03-3807-999","03-3139657","03-2170172","03-3970761","03-4824839","03-4685899","03-3368758","03-4278266","03-3885511","03-3284108.","03-3867448","03-3638510","03-2120206","03-3319621","03-4514505","03-4870528","03-4833015","03-4992236","03-4852081","03-4396011","03-3355575","03-4801508","03-4686738","03-4922716","03-3170681","03-3972052","03-4565562","03-3335977","03-4628651","03-4638812","03-3882276","03-3882206","03-3266654","03-4311995","03-2889590","03-3614007","03-4564946","03-4511208","03-4194550","03-4253038","03-4595111","03-4984488","03-2126642","03-3129045","03-4993793","03-4794412","03-3631517","03-4226358","03-3665371","03-480-3831","07-7450309","07-7490883","07-7225055","07-7220808","07-3531053","07-7159533","07-7468029","07-6101060","07-7151149","07-7030096","07-6622565","07-3539869","07-3845050","07-7619334","07-7219332","07-7117100","07-3728289","07-5612677","07-5584259","07-3652942","07-6113632","07-7912331","07-3542200","07-6102767","07-7671343","07-3355113","07-5815069","07-7468840","07-3825577","08-7819515","07-3596913","07-3513339","07-3685545","07-3596429","07-5817895","07-5508862","07-3419363","07-6313928","07-3757869","07-6231391","07-5368701","07-3710807","07-3837833","07-3458378","07-6429592","07-7862818","07-3473271","07-6214459","07-3643352","07-8114803","07-2853395","07-3109479","07-5855767","07-5514652","07-2859635","07-3626893","07-3712815","07-7119786","07-7034256","07-7522786","07-6818321","07-7779771","07-5518440","07-3313535","07-6412641","07-6623545","07-3612640","07-5814618","07-3215681","07-5833228","07-6212163","07-7719152","07-5827329","07-6938208","07-6264538","07-8216030","07-6172407","07-6230222","07-3653534","07-5815858","07-3102683","07-3107072","07-3945146","07-3815186","07-3736437","07-3535458","07-3743243","07-5520736","07-5582806","07-7676179","07-5521007","07-3643074","07-3501870","07-3460931","07-3410915","07-5521019","07-765-2243","07-5524680","07-5573857","07-8232378","07-3100696","07-3661348","07-7482246","07-7816570","07-6412456","07-7465530","07-2885454","07-8011846","07-7825213","07-3630805","07-6250942","07-3923111","07-6612057","07-3520061","07-7462525","02-24258762","02-24223760","02-24222978","02-24321739","02-24628789","02-24344550","02-25775000","02-24202827","05-5862222","05-5349507","05-5322036","05-5972134","05-6651758","05-6976066","05-5322438","05-7852721","05-5989955","05-6913861","05-5899896","05-5842824","05-5322402","05-5347619","05-5913677","05-6622889","05-6962769","05-6326456","05-5953727","05-5873287","05-6624778","05-6991031","05-6314168","05-7820005","02-22451379","02-89146301","02-26711560","02-28098022","02-29590964","02-22510338","02-29560576","02-29655351","02-29610311","02-29763895","02-22887676","02-29813155","02-22733868","02-22566497","02-22818227","02-86312050","02-29857456","02-29945270","02-77230208","02-29856852","02-26738535","02-29242484","02-22318585","02-29183565","02-29282000","02-26871276","02-29291655","02-26927733","02-287-9836","02-22626111","02-86712269","02-29924496","02-22065185","02-26295693","02-22626870","02-29637248","02-29670258","02-26924087","02-2625-5847","02-29715020","02-29127861","02-22915932","02-82619585","02-26792356","02-89115998","02-26810386","02-22530009","02-22085138","02-29432239","02-22063806","02-24931085","02-22265758","02-82866803","02-29886892","02-86875503","02-29426196","02-22725358","02-29717277","02-29485177","02-29263191","02-29175888","02-29461128","02-26257059","02-89929482","02-28082179","02-28253258","02-29876838","02 26422048","02-29125526","02-82218338","02-89824272","02-22925067","02-29203865","02-29272767","02-29567309","02-29543930","02-22630230","02-29590964","02-287-7692","02-22080528","02-22972121","02-82520408#105","02-86775363","02-26011312","02-29288118","02-8911-6029","02-89147015","02-29151709  ","02-86655371 ","02-22189610","02-29186266","02-22830704","02-26739797","02-22668525","02-22655056","02-28477845","02-82863837","02-26962999","02-26211448","02-22606812","02-29264391","02-29095662","02-22893899","02-82871076","02-82867383 ","02-22536951","02-26711125","02-2522204","02-22610590","02-22774399","02-29788120","02-22648655","02-29901680","02-27892200","02-22593926","02-26101072","02-22235319","02-22827527","02-22257728","02-22540613","02-22580963","02-22540613","02-22547482","02-86916091","02-89431417","02-86655462","02-22656056","02-29717291","02-22025576","02-29211798","02-22783277","02-29602748","02-29786003","02-29724765","02-26818663","02-22622588","02-29827688","02-89674888","02-29769055","02-29894735","02-22921143","02-26709693","03-5740112","03-5334827","03-5625398","03-5232361","03-5245838","03-5321636","03-5233111","03-5621111","03-5315188","03 5321636","03-5228968","03-5152255","03-5314948","03-5719019","03-5780595","03-5351207","03-6686912","03-5740098","03-5713825","03-5310616","03-5306645","03-5191010","03-5290999","03-7598995","03-5256938","03-5381552","03-5619753","03-5962335","03-6583777","03-5552288","03-5103818","03-6992365","03-5972606","03-5104721","03-6589478","03-5996388","03-6992580","03-6993528","03-5889009","03-5578990","03-5960360","03-5518093","03-5940019","03-5963549","03-5836490","05-2285812","05-2330230","05-2861880","05-2168605","05-2754836","05-2168905","05-2777900","05-2910585","05-2355588","05-2687897","05-2168905","05-2843514","05-2252733","05-2861880","05-3704552","05-2652127","05-2201138","05-2838088","05-2792226","05-2691218","05-3792265","05-2654246","05-3748533","05-3792664","05-2611016","04-8956818","04-7635422","04-7880073","04-8221821","04-8321553","04-8378553","04-8324986","04-7567339","04-7772391","04-8280957","04-8320990","04-8881669","04-8792593","04-7773078","04-7992663","04-7713497","04-7559952","04-7569718","04-7113332","04-7689699","04-7882818","04-7291519","04-7227761","04-8358827","04-7863990","04-7566092","04-7330458","04-8330918","04-8367007","049-2522391","04-7755540","04-7686649","049-2522858","04-8922162","04-7234725","04-8732473","04-8926166","04-7862361","04-7782098","04-7552334","04-7234408","04-8954029","04-7233018","04-8320627","04-8613668","04-8360617"],
            storeChannel: 1,
            storeCity1: '',
            storeCity2: '',
            citiSelectedIndex: 0,
        },
        gaArr: [],
        qaData: {
            activeIndex: 1,
            qas: [{
                q: "合利他命EX PLUS強效錠是什麼產品?",
                a: "針對緩解「眼睛疲勞」、「腰背酸痛」、「肩頸僵硬」等酸痛症狀而設計。"
            }, {
                q: "產品在什麼地方製造?",
                a: "合利他命EX PLUS強效錠是由日本武田藥品研發，於日本製造及包裝，再原裝進口至台灣，成分與日本出售的相同。"
            }, {
                q: "什麼是TTFD?",
                a: "武田藥品研發的TTFD是維他命B1衍生物(又稱維他命B1誘導體)，能令維他命B1更容易被吸收，並有效作用於神經與肌肉組織，從根源緩解酸痛。"
            }, {
                q: "什麼是泛酸鈣?",
                a: "參與能量代謝，用於燃燒脂肪、膽固醇的合成及胺基酸的代謝，是輔酵素A的成分之一。"
            }, {
                q: "什麼是γ-穀維素？",
                a: "可協助維生素B1、B6、B12發揮作用。"
            }, {
                q: "每天一次，我應該什麼時候服用？",
                a: "請在飯後服用，在早上、中午或晚上，都是有效的。"
            }, {
                q: "服用多久才有效?",
                a: "服用效果依個人體質及吸收能力而有效果，建議持續服用一個月，若情況未有改善，建議徵詢醫師意見，進一步了解酸痛背後原因。"
            }, {
                q: "產品含大蒜成分嗎? ",
                a: "合利他命EX PLUS強效錠不含大蒜成份所使用的Fursultiamine(維生素B1誘導體)，其特殊氣味與大蒜相似，導致部分消費者誤以為含有大蒜成份。"
            }, {
                q: "適合什麼年齡服用?",
                a: "15歲以上即可服用。"
            }, {
                q: "為何台灣販售的合利他命EX PLUS強效錠所標示的劑量跟台灣買的不一樣?",
                a: "台灣販售的合利他命EX PLUS強效錠與日本當地販售的EX PLUS成分、劑量、用法用量完全無調整。日文版所標示的劑量是 3 錠的總含量，台灣標示的是每 1 錠之含量，將該劑量乘以3便等於日文版的劑量"
            }, {
                q: "為什麼在一些藥局或是在網路上也可以買到全日文標示的合利他命EX PLUS強效錠?",
                a: "請認明包裝上印有台灣武田、有中文標示的合利他命EX PLUS強效錠，才是合法自日本原裝進口的產品，從生產到配送嚴格依照法規管控品質，保障消費者用藥安全。全日文版本之產品並非台灣武田公司進口之包裝，亦非衛福部核准之產品，其商品來源與品質均缺乏保障。"
            }]
        },
        posIndex: -1,
        isLoaded: false,

    },
    computed: {

        citiSelect2: function () {
            var index = this.storeData.citi1Arr.indexOf(this.storeData.storeCity1);
            return (index == -1) ? [] : this.storeData.citiArr2[index];
        },
        showCitiArr: function () {
            var arr = [];
            var data = this.storeData;

            if (data.storeCity1 == '' && data.storeCity2 == '') {
                return arr
            }

            $.each(data.p_storeArr, function (index, el) {
                if (el.indexOf(data.storeCity1) != -1 && el.indexOf(data.storeCity2) != -1) {
                    arr.push({
                        name: data.p_storeName[index],
                        addr: el,
                        phone: data.p_storePhone[index]
                    })
                }
            });
            return arr
        }
    },
    watch: {
        posIndex: function (val) {
            if (this.gaArr.indexOf(val) == -1) {
                this.gaArr.push(val);
                //ga('send', 'pageview', '/event/section' + val);
                gtag('config', 'UA-124659146-2', {'page_path': '/event/section'+val});
                console.log('ga:' + val);
            }
        },
        videoPop: function(val){
            if(val){
                console.log('open');
                //ga('send', 'event', 'openVideo');
                gtag('event', 'openVideo');
            }else{
                //ga('send', 'event', 'clozVideo');
                gtag('event', 'clozVideo');
            }
        }
    },
    mounted: function () {
        this.isPhone = ChungTool.isPhone();
        console.log('ChungTool.isPhone(): ', ChungTool.isPhone());
        var that = this;
        var header = $('#header');
        var point1 = $('#sticky-point');
        var point2 = $('#sticky-point2');
        var sickMenu = $('#sickMenu');
        var mt = 0;

        setInterval(function () {
            let top = $(window).scrollTop();
            if (top > 200) {
                header.addClass('redBg');
            } else {
                header.removeClass('redBg');
            }
            if (that.isPhone) {
                let sickTop = top - point1.offset().top + 70;
                let height = sickMenu.height();
                let height2 = top - point2.offset().top + height + 70;

                if (sickTop > 0) {
                    sickMenu.addClass('sticky');
                    point1.css('height', height + 'px');
                    sickMenu.css('top', Math.min(70, -height2))
                } else {
                    sickMenu.removeClass('sticky');
                    sickMenu.css('top', 0)
                    point1.css('height', 0);
                }
            }

            var posIndex = 0;
            $('.page-point').each(function (index, el) {
                var pos = top - $(el).offset().top;
                posIndex = (pos + 500 > 0) ? index + 1 : posIndex;
            });
            that.posIndex = posIndex;


            $('.fadeIn-onScroll').each(function (index, el) {
                var offset = $(el).attr('data-offset')
                offset = offset || -500
                if (top - $(el).offset().top > offset) {
                    $(this).addClass('active')
                }
            })


        }, 100)


        //load
        $('.loadingFirst').waitForImages({
            finished: function () {
                that.isLoaded = true;
                that.playAni();
            },
            each: function (loaded, count, success) {
                var r = Math.floor(loaded / count * 100);
            },
            waitForAll: true
        });

        $('.my-paroller').paroller();

        let sickIndex = +this.getUrlParameter("subPage") - 1;
        $('.sickMenu .sBtn').eq(sickIndex).trigger('click');
    },
    methods: {
        limitRange: function (num, min, max) {
            return Math.max(Math.min(num, max), min)
        },
        switchSick(sid){
            this.sickChannel = sid;
            //ga('send', 'event', 'sickBtn'+ sid);
            gtag('event', 'sickBtn'+ sid);
        },
        playAni: function () {

            var tl = new TimelineMax({
                delay: .3
            });

            tl.set('.ani_items', {
                    autoAlpha: 0
                })
                .fromTo('#ani_man', .8, {
                    bottom: -200
                }, {
                    bottom: 0,
                    autoAlpha: 1
                })
                .staggerFromTo('.ani_t', 1.6, {
                    left: 60
                }, {
                    left: 0,
                    autoAlpha: 1,
                    ease: Power3.easeOut
                }, .2, '-=.4')
                .fromTo('#ani_balls', .6, {
                    marginTop: 0
                }, {
                    marginTop: -30,
                    autoAlpha: 1
                }, '-=1.2')
                .fromTo('#ani_pro', 1, {
                    marginLeft: 200
                }, {
                    marginLeft: 0,
                    autoAlpha: 1
                }, '-=.8')
                .fromTo('#ani_proTxt', .6, {
                    marginLeft: -50
                }, {
                    marginLeft: 0,
                    autoAlpha: 1
                }, '-=.6')
        },
        runAnime: function () {
            console.log(456);
        },
        getUrlParameter: function (sParam) {
            var sPageURL = decodeURIComponent(window.location.search.substring(1)),
                sURLVariables = sPageURL.split("&"),
                sParameterName,
                i;

            for (i = 0; i < sURLVariables.length; i++) {
                sParameterName = sURLVariables[i].split("=");

                if (sParameterName[0] === sParam) {
                    return sParameterName[1] === undefined ? true : sParameterName[1];
                }
            }
        }

    }

})
